[
  {
    "title": "The Housemaid's Secret",
    "description": "As he continues showing me their incredible penthouse apartment, I have a terrible feeling about the woman behind closed doors. But I can't risk losing this job – not if I want to keep my darkest secret safe . . .It's hard to find an employer who doesn't ask too many questions about my past. So I thank my lucky stars that the Garricks miraculously give me a job, cleaning their stunning penthouse with views across the city and preparing fancy meals in their shiny kitchen. I can work here for a while, stay quiet until I get what I want. It's almost perfect. But I still haven't met Mrs Garrick, or seen inside the guest bedroom. I'm sure I hear her crying. I notice spots of blood around the neck of her white nightgowns when I'm doing laundry. And one day I can't help but knock on the door. When it gently swings open, what I see inside changes everything...That's when I make a promise. After all, I've done this before. I can protect Mrs. Garrick while keeping my own secrets locked up safe. Douglas Garrick has done wrong. He is going to pay. It's simply a question of how far I'm willing to go...",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1664729357i/62848145.jpg",
    "category": [
      "Thriller",
      "Mystery",
      "Mystery Thriller",
      "Fiction",
      "Suspense",
      "Audiobook",
      "Psychological Thriller"
    ],
    "author": "Freida McFadden",
    "price": 16.51
  },
  {
    "title": "None of This Is True",
    "description": "Lisa Jewell returns with a scintillating new psychological thriller about a woman who finds herself the subject of her own popular true crime podcast.Celebrating her forty-fifth birthday at her local pub, popular podcaster Alix Summers crosses paths with an unassuming woman called Josie Fair. Josie, it turns out, is also celebrating her forty-fifth birthday. They are, in fact, birthday twins.A few days later, Alix and Josie bump into each other again, this time outside Alix’s children’s school. Josie has been listening to Alix’s podcasts and thinks she might be an interesting subject for her series. She is, she tells Alix, on the cusp of great changes in her life.Josie’s life appears to be strange and complicated, and although Alix finds her unsettling, she can’t quite resist the temptation to keep making the podcast. Slowly she starts to realise that Josie has been hiding some very dark secrets, and before she knows it, Josie has inveigled her way into Alix’s life—and into her home.But, as quickly as she arrived, Josie disappears. Only then does Alix discover that Josie has left a terrible and terrifying legacy in her wake, and that Alix has become the subject of her own true crime podcast, with her life and her family’s lives under mortal threat.Who is Josie Fair? And what has she done?",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1686092508i/62334530.jpg",
    "category": [
      "Thriller",
      "Mystery",
      "Audiobook",
      "Fiction",
      "Mystery Thriller",
      "Suspense",
      "Crime"
    ],
    "author": "Lisa Jewell",
    "price": 12.13
  },
  {
    "title": "The Only One Left",
    "description": "At seventeen, Lenora HopeHung her sister with a ropeNow reduced to a schoolyard chant, the Hope family murders shocked the Maine coast one bloody night in 1929. While most people assume seventeen-year-old Lenora was responsible, the police were never able to prove it. Other than her denial after the killings, she has never spoken publicly about that night, nor has she set foot outside Hope’s End, the cliffside mansion where the massacre occurred.Stabbed her father with a knifeTook her mother’s happy lifeIt’s now 1983, and home-health aide Kit McDeere arrives at a decaying Hope’s End to care for Lenora after her previous nurse fled in the middle of the night. In her seventies and confined to a wheelchair, Lenora was rendered mute by a series of strokes and can only communicate with Kit by tapping out sentences on an old typewriter. One night, Lenora uses it to make a tantalizing offer—I want to tell you everything.“It wasn’t me,” Lenora saidBut she’s the only one not deadAs Kit helps Lenora write about the events leading to the Hope family massacre, it becomes clear there’s more to the tale than people know. But when new details about her predecessor’s departure come to light, Kit starts to suspect Lenora might not be telling the complete truth—and that the seemingly harmless woman in her care could be far more dangerous than she first thought.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1668181003i/62703226.jpg",
    "category": [
      "Thriller",
      "Mystery",
      "Mystery Thriller",
      "Fiction",
      "Horror",
      "Audiobook",
      "Suspense"
    ],
    "author": "Riley Sager",
    "price": 15.24
  },
  {
    "title": "Vera Wong's Unsolicited Advice for Murderers",
    "description": "Put the kettle on, there’s a mystery brewing…Tea-shop owner. Matchmaker. Detective?Sixty-year-old self-proclaimed tea expert Vera Wong enjoys nothing more than sipping a good cup of Wulong and doing some healthy ‘detective’ work on the internet (AKA checking up on her son to see if he’s dating anybody yet).But when Vera wakes up one morning to find a dead man in the middle of her tea shop, it’s going to take more than a strong Longjing to fix things. Knowing she’ll do a better job than the police possibly could – because nobody sniffs out a wrongdoing quite like a suspicious Chinese mother with time on her hands – Vera decides it’s down to her to catch the killer.Nobody spills the tea like this amateur sleuth.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1677871383i/61327512.jpg",
    "category": [
      "Mystery",
      "Fiction",
      "Audiobook",
      "Mystery Thriller",
      "Cozy Mystery",
      "Contemporary",
      "Adult"
    ],
    "author": "Jesse Q. Sutanto",
    "price": 19.83
  },
  {
    "title": "Bright Young Women",
    "description": "An extraordinary novel inspired by the real-life sorority targeted by America's first celebrity serial killer in his final murderous spree.January 1978. A serial killer has terrorized women across the Pacific Northwest, but his existence couldn’t be further from the minds of the vibrant young women at the top sorority on Florida State University’s campus in Tallahassee. Tonight is a night of promise, excitement, and desire, but Pamela Schumacher, president of the sorority, makes the unpopular decision to stay home—a decision that unwittingly saves her life. Startled awake at 3 a.m. by a strange sound, she makes the fateful decision to investigate. What she finds behind the door is a scene of implausible violence—two of her sisters dead; two others, maimed. Over the next few days, Pamela is thrust into a terrifying mystery inspired by the crime that’s captivated public interest for more than four decades.On the other side of the country, Tina Cannon has found peace in Seattle after years of hardship. A chance encounter brings twenty-five-year-old Ruth Wachowsky into her life, a young woman with painful secrets of her own, and the two form an instant connection. When Ruth goes missing from Lake Sammamish State Park in broad daylight, surrounded by thousands of beachgoers on a beautiful summer day, Tina devotes herself to finding out what happened to her. When she hears about the tragedy in Tallahassee, she knows it’s the man the papers refer to as the All-American Sex Killer. Determined to make him answer for what he did to Ruth, she travels to Florida on a collision course with Pamela—and one last impending tragedy.Bright Young Womenis the story about two women from opposite sides of the country who become sisters in their fervent pursuit of the truth. It proposes a new narrative inspired by evidence that’s been glossed over for decades in favor of more salable headlines—that the so-called brilliant and charismatic serial killer from Seattle was far more average than the countless books, movies, and primetime specials have led us to believe, and that it was the women whose lives he cut short who were the exceptional ones.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1676221840i/101124639.jpg",
    "category": [
      "Thriller",
      "Fiction",
      "Historical Fiction",
      "Mystery",
      "Mystery Thriller",
      "Audiobook",
      "Crime"
    ],
    "author": "Jessica Knoll",
    "price": 18.82
  },
  {
    "title": "All the Dangerous Things",
    "description": "One year ago, Isabelle Drake's life changed forever: her toddler son, Mason, was taken out of his crib in the middle of the night while she and her husband were asleep in the next room. With little evidence and few leads for the police to chase, the case quickly went cold. However, Isabelle cannot rest until Mason is returned to her—literally.Except for the occasional catnap or small blackout where she loses track of time, she hasn’t slept in a year.Isabelle's entire existence now revolves around finding him, but she knows she can’t go on this way forever. In hopes of jarring loose a new witness or buried clue, she agrees to be interviewed by a true-crime podcaster—but his interest in Isabelle's past makes her nervous. His incessant questioning paired with her severe insomnia has brought up uncomfortable memories from her own childhood, making Isabelle start to doubt her recollection of the night of Mason’s disappearance, as well as second-guess who she can trust... including herself. But she is determined to figure out the truth no matter where it leads.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1652631076i/60784636.jpg",
    "category": [
      "Thriller",
      "Mystery",
      "Mystery Thriller",
      "Fiction",
      "Audiobook",
      "Suspense",
      "Adult"
    ],
    "author": "Stacy Willingham",
    "price": 12.47
  },
  {
    "title": "I Have Some Questions for You",
    "description": "A successful film professor and podcaster, Bodie Kane is content to forget her past—the family tragedy that marred her adolescence, her four largely miserable years at a New Hampshire boarding school, and the murder of her former roommate, Thalia Keith, in the spring of their senior year. Though the circumstances surrounding Thalia's death and the conviction of the school's athletic trainer, Omar Evans, are hotly debated online, Bodie prefers—needs—to let sleeping dogs lie.But when the Granby School invites her back to teach a course, Bodie is inexorably drawn to the case and its increasingly apparent ﬂaws. In their rush to convict Omar, did the school and the police overlook other suspects? Is the real killer still out there? As she falls down the very rabbit hole she was so determined to avoid, Bodie begins to wonder if she wasn't as much of an outsider at Granby as she'd thought—if, perhaps, back in 1995, she knew something that might have held the key to solving the case.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1658970269i/61053829.jpg",
    "category": [
      "Fiction",
      "Mystery",
      "Audiobook",
      "Thriller",
      "Mystery Thriller",
      "Crime",
      "Contemporary"
    ],
    "author": "Rebecca Makkai",
    "price": 18.71
  },
  {
    "title": "All the Sinners Bleed",
    "description": "A Black sheriff. A serial killer. A small town ready to combust.Titus Crown is the first Black sheriff in the history of Charon County, Virginia. In recent decades, Charon has had only two murders. After years of working as an FBI agent, Titus knows better than anyone that while his hometown might seem like a land of moonshine, cornbread, and honeysuckle, secrets always fester under the surface.Then a year to the day after Titus’s election, a school teacher is killed by a former student and the student is fatally shot by Titus’s deputies. Those festering secrets are now out in the open and ready to tear the town apart.As Titus investigates the shootings, he unearths terrible crimes and a serial killer who has been hiding in plain sight, haunting the dirt lanes and woodland clearings of Charon. With the killer’s possible connections to a local church and the town’s harrowing history weighing on him, Titus projects confidence about closing the case while concealing a painful secret from his own past. At the same time, he also has to contend with a far-right group that wants to hold a parade in celebration of the town’s Confederate history.Powerful and unforgettable,All the Sinners Bleedconfirms S. A. Cosby as “one of the most muscular, distinctive, grab-you-by-both-ears voices in American crime fiction” (The Washington Post).",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1663544598i/61884832.jpg",
    "category": [
      "Mystery",
      "Fiction",
      "Thriller",
      "Mystery Thriller",
      "Crime",
      "Audiobook",
      "Suspense"
    ],
    "author": "S.A. Cosby",
    "price": 17.26
  },
  {
    "title": "The River We Remember",
    "description": "In 1958, a small Minnesota town is rocked by the murder of its most powerful citizen, pouring fresh fuel on old grievances in this dazzling standalone novel.On Memorial Day, as the people of Jewel, Minnesota gather to remember and honor the sacrifice of so many sons in the wars of the past, the half-clothed body of wealthy landowner Jimmy Quinn is found floating in the Alabaster River, dead from a shotgun blast. Investigation of the murder falls to Sheriff Brody Dern, a highly decorated war hero who still carries the physical and emotional scars from his military service. Even before Dern has the results of the autopsy, vicious rumors begin to circulate that the killer must be Noah Bluestone, a Native American WWII veteran who has recently returned to Jewel with a Japanese wife. As suspicions and accusations mount and the town teeters on the edge of more violence, Dern struggles not only to find the truth of Quinn’s murder but also put to rest the demons from his own past.Caught up in the torrent of anger that sweeps through Jewel are a war widow and her adolescent son, the intrepid publisher of the local newspaper, an aging deputy, and a crusading female lawyer, all of whom struggle with their own tragic histories and harbor secrets that Quinn’s death threatens to expose.Both a complex, spellbinding mystery and a masterful portrait of midcentury American life,The River We Rememberis an unflinching look at the wounds left by the wars we fight abroad and at home, a moving exploration of the ways in which we seek to heal, and a testament to the enduring power of the stories we tell about the places we call home.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1688068221i/101160844.jpg",
    "category": [
      "Historical Fiction",
      "Mystery",
      "Fiction",
      "Audiobook",
      "Thriller",
      "Mystery Thriller",
      "Historical"
    ],
    "author": "William Kent Krueger",
    "price": 19.17
  },
  {
    "title": "The Villa",
    "description": "FromNew York Timesbestselling author Rachel Hawkins comes a deliciously wicked gothic suspense, set at an Italian villa with a dark history, for fans of Lucy Foley and Ruth Ware.As kids, Emily and Chess were inseparable. But by their 30s, their bond has been strained by the demands of their adult lives. So when Chess suggests a girls trip to Italy, Emily jumps at the chance to reconnect with her best friend.Villa Aestas in Orvieto is a high-end holiday home now, but in 1974, it was known as Villa Rosato, and rented for the summer by a notorious rock star, Noel Gordon. In an attempt to reignite his creative spark, Noel invites up-and-coming musician, Pierce Sheldon to join him, as well as Pierce’s girlfriend, Mari, and her stepsister, Lara. But he also sets in motion a chain of events that leads to Mari writing one of the greatest horror novels of all time, Lara composing a platinum album––and ends in Pierce’s brutal murder.As Emily digs into the villa’s complicated history, she begins to think there might be more to the story of that fateful summer in 1974. That perhaps Pierce’s murder wasn’t just a tale of sex, drugs, and rock & roll gone wrong, but that something more sinister might have occurred––and that there might be clues hidden in the now-iconic works that Mari and Lara left behind.Yet the closer that Emily gets to the truth, the more tension she feels developing between her and Chess. As secrets from the past come to light, equally dangerous betrayals from the present also emerge––and it begins to look like the villa will claim another victim before the summer ends.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1651426717i/60784641.jpg",
    "category": [
      "Mystery",
      "Thriller",
      "Fiction",
      "Audiobook",
      "Mystery Thriller",
      "Suspense",
      "Adult"
    ],
    "author": "Rachel Hawkins",
    "price": 11.64
  },
  {
    "title": "Happy Place",
    "description": "Harriet and Wyn have been the perfect couple since they met in college—they go together like salt and pepper, honey and tea, lobster and rolls. Except, now—for reasons they’re still not discussing—they don’t.They broke up six months ago. And still haven’t told their best friends.Which is how they find themselves sharing the largest bedroom at the Maine cottage that has been their friend group’s yearly getaway for the last decade. Their annual respite from the world, where for one vibrant, blue week they leave behind their daily lives; have copious amounts of cheese, wine, and seafood; and soak up the salty coastal air with the people who understand them most.Only this year, Harriet and Wyn are lying through their teeth while trying not to notice how desperately they still want each other. Because the cottage is for sale and this is the last week they’ll all have together in this place. They can’t stand to break their friends’ hearts, and so they’ll play their parts. Harriet will be the driven surgical resident who never starts a fight, and Wyn will be the laid-back charmer who never lets the cracks show. It’s a flawless plan (if you look at it from a great distance and through a pair of sunscreen-smeared sunglasses). After years of being in love, how hard can it be to fake it for one week… in front of those who know you best?A couple who broke up months ago make a pact to pretend to still be together for their annual weeklong vacation with their best friends in this glittering and wise new novel from #1 New York Times bestselling author Emily Henry.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660145160i/61718053.jpg",
    "category": [
      "Romance",
      "Fiction",
      "Contemporary",
      "Audiobook",
      "Contemporary Romance",
      "Adult",
      "Chick Lit"
    ],
    "author": "Emily Henry",
    "price": 10.24
  },
  {
    "title": "Love, Theoretically",
    "description": "The many lives of theoretical physicist Elsie Hannaway have finally caught up with her. By day, she’s an adjunct professor, toiling away at grading labs and teaching thermodynamics in the hopes of landing tenure. By other day, Elsie makes up for her non-existent paycheck by offering her services as a fake girlfriend, tapping into her expertly honed people pleasing skills to embody whichever version of herself the client needs.Honestly, it’s a pretty sweet gig—until her carefully constructed Elsie-verse comes crashing down. Because Jack Smith, the annoyingly attractive and broody older brother of her favorite client, turns out to be the cold-hearted experimental physicist who ruined her mentor’s career and undermined the reputation of theorists everywhere. And that same Jack who now sits on the hiring committee at MIT, right between Elsie and her dream job.Elsie is prepared for an all-out war of scholarly sabotage but…those long, penetrating looks? Not having to be anything other than her true self when she’s with him? Will falling into an experimentalist’s orbit finally tempt her to put her most guarded theories on love into practice?",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1681476644i/61326735.jpg",
    "category": [
      "Romance",
      "Contemporary",
      "Contemporary Romance",
      "Fiction",
      "Audiobook",
      "Adult",
      "Chick Lit"
    ],
    "author": "Ali Hazelwood",
    "price": 10.64
  },
  {
    "title": "Yours Truly",
    "description": "A novel of terrible first impressions, hilarious second chances, and the joy in finding your perfect match.Dr. Briana Ortiz’s life is seriously flatlining. Her divorce is just about finalized, her brother’s running out of time to find a kidney donor, and that promotion she wants? Oh, that’s probably going to the new man-doctor who’s already registering eighty-friggin’-seven on Briana’s “pain in my ass” scale. But just when all systems are set to hate, Dr. Jacob Maddox completely flips the game . . . by sending Briana a letter.And it’s a really good letter. Like the kind that proves that Jacob isn’t actually Satan. Worse, he might be this fantastically funny and subversively likeable guy who’s terrible at first impressions. Because suddenly he and Bri are exchanging letters, sharing lunch dates in her “sob closet,” and discussing the merits of freakishly tiny horses. But when Jacob decides to give Briana the best gift imaginable—a kidney for her brother—she wonders just how she can resist this quietly sexy new doctor . . . especially when he calls in a favor shecan’trefuse.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660857282i/61918816.jpg",
    "category": [
      "Romance",
      "Fiction",
      "Audiobook",
      "Contemporary",
      "Contemporary Romance",
      "Adult",
      "Chick Lit"
    ],
    "author": "Abby Jimenez",
    "price": 12.62
  },
  {
    "title": "Romantic Comedy",
    "description": "A comedy writer thinks she’s sworn off love, until a dreamily handsome pop star flips the script on all her assumptions.Romantic Comedyis a hilarious, observant and deeply tender novel fromNew York Times–bestselling author Curtis Sittenfeld.Sally Milz is a sketch writer for \"The Night Owls,\" the late-night live comedy show that airs each Saturday. With a couple of heartbreaks under her belt, she’s long abandoned the search for love, settling instead for the occasional hook-up, career success, and a close relationship with her stepfather to round out a satisfying life.But when Sally’s friend and fellow writer Danny Horst begins dating Annabel, a glamorous actor who guest-hosted the show, he joins the not-so-exclusive group of talented but average-looking and even dorky men at the show—and in society at large—who’ve gotten romantically involved with incredibly beautiful and accomplished women. Sally channels her annoyance into a sketch called the \"Danny Horst Rule,\" poking fun at this phenomenon while underscoring how unlikely it is that the reverse would ever happen for a woman.Enter Noah Brewster, a pop music sensation with a reputation for dating models, who signed on as both host and musical guest for this week’s show. Dazzled by his charms, Sally hits it off with Noah instantly, and as they collaborate on one sketch after another, she begins to wonder whether there might actually be sparks flying. But this isn’t a romantic comedy; it’s real life. And in real life, someone like him would never date someone like her...right?With her keen observations and trademark ability to bring complex women to life on the page, Sittenfeld explores the neurosis-inducing and heart-fluttering wonder of love, while slyly dissecting the social rituals of romance and gender relations in the modern age.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1679496983i/62628727.jpg",
    "category": [
      "Romance",
      "Fiction",
      "Audiobook",
      "Contemporary",
      "Chick Lit",
      "Adult",
      "Contemporary Romance"
    ],
    "author": "Curtis Sittenfeld",
    "price": 11.03
  },
  {
    "title": "Final Offer",
    "description": "CallahanI’m the Kane brother everyone gossips about behind closed doors.Trust fund brat. Washed-up athlete. High-functioning alcoholic.No one knows the real me but her.Lana Castillo—my childhood best friend and the only woman I ever loved.When I broke her heart six years ago, I promised to never return to Lake Wisteria.I kept my word until my grandfather’s will changed everything.To receive my inheritance, I was tasked with spending a summer at the family lake house before selling it.The request was simple in theory until my entire plan blew up on the very first day.Turns out Lana doesn’t just live at the house, but she claims to own it, too.AlanaFalling in love with Callahan Kane was a mistake.He told me so before destroying my heart and our friendship six summers ago.When he promised never to come back, I foolishly believed him.But then Cal showed up again, intending to sell his grandfather’s lake house.The biggest flaw in his plan?My name is on the deed.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1675342454i/61681786.jpg",
    "category": [
      "Romance",
      "Contemporary Romance",
      "Contemporary",
      "Fiction",
      "Adult",
      "New Adult",
      "Audiobook"
    ],
    "author": "Lauren Asher",
    "price": 19.54
  },
  {
    "title": "King of Pride",
    "description": "She's his opposite in every way...and the greatest temptation he's ever known.Reserved, controlled, and proper to a fault, Kai Young has neither the time nor inclination for chaos—and Isabella, with her purple hair and inappropriate jokes, is chaos personified.With a crucial CEO vote looming and a media empire at stake, the billionaire heir can’t afford the distraction she brings.Isabella is everything he shouldn’t want, but with every look and every touch, he’s tempted to break all his rules…and claim her as his own.***Bold, impulsive, and full of life, Isabella Valencia has never met a party she doesn’t like or a man she couldn’t charm...except for Kai Young.It shouldn’t matter. He’s not her type—the man translates classics into Latin for fun, and his membership at the exclusive club where she bartends means he’s strictly off limits.But she can’t deny that, beneath his cool exterior, is a man who could make her melt with just a touch.No matter how hard they try, they can’t resist giving into their forbidden desires.Even if it costs them everything.King of Pride is a steamy opposite attract, forbidden billionaire romance. It's book two in the Kings of Sin series but can be read as a standalone.Contains explicit content and profanity. Recommended for mature readers only.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1680192054i/62994279.jpg",
    "category": [
      "Romance",
      "Contemporary Romance",
      "Contemporary",
      "Adult",
      "Fiction",
      "New Adult",
      "Audiobook"
    ],
    "author": "Ana Huang",
    "price": 16.41
  },
  {
    "title": "The Seven Year Slip",
    "description": "An overworked book publicist with a perfectly planned future hits a snag when she falls in love with her temporary roommate…only to discover he lives seven years in the past, in this witty and wise new novel from theNew York Timesbestselling author ofThe Dead Romantics.Sometimes, the worst day of your life happens, and you have to figure out how to live after it.So Clementine forms a plan to keep her heart safe: work hard, find someone decent to love, and try to remember to chase the moon. The last one is silly and obviously metaphorical, but her aunt always told her that you needed at least one big dream to keep going. And for the last year, that plan has gone off without a hitch. Mostly. The love part is hard because she doesn’t want to get too close to anyone—she isn’t sure her heart can take it.And then she finds a strange man standing in the kitchen of her late aunt’s apartment. A man with kind eyes and a Southern drawl and a taste for lemon pies. The kind of man that, before it all, she would’ve fallen head-over-heels for. And she might again.Except, he exists in the past. Seven years ago, to be exact. And she, quite literally, lives seven years in his future.Her aunt always said the apartment was a pinch in time, a place where moments blended together like watercolors. And Clementine knows that if she lets her heart fall, she’ll be doomed.After all, love is never a matter of time—but a matter of timing.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1685350807i/62926938.jpg",
    "category": [
      "Romance",
      "Fiction",
      "Contemporary",
      "Magical Realism",
      "Audiobook",
      "Time Travel",
      "Fantasy"
    ],
    "author": "Ashley Poston",
    "price": 12.29
  },
  {
    "title": "Wildfire",
    "description": "The latest in the Maple Hills series follows two summer camp counselors who reconnect after a sizzling one-night stand.Maple Hills students Russ Callaghan and Aurora Roberts cross paths at a party celebrating the end of the academic year, where a drinking game results in them having a passionate one-night stand. Never one to overstay her welcome (or expect much from a man), Aurora slips away before Russ even has the chance to ask for her full name.Imagine their surprise when they bump into each other on the first day of the summer camp where they are both counselors, hoping to escape their complicated home lives by spending the summer working. Russ hopes if he gets far enough away from Maple Hills, he can avoid dealing with the repercussions of his father’s gambling addiction, while Aurora is tired of craving attention from everyone around her, and wants to go back to the last place she truly felt at home.Russ knows breaking the camp’s strict “no staff fraternizing” rule will have him heading back to Maple Hills before the summer is over, but unfortunately for him, Aurora has never been very good at caring about the rules. Will the two learn to peacefully coexist? Or did their one night together start a fire they can’t put out?",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1688314784i/101145836.jpg",
    "category": [
      "Sports Romance",
      "Contemporary",
      "Audiobook",
      "Contemporary Romance",
      "New Adult",
      "Hockey",
      "Sports"
    ],
    "author": "Hannah  Grace",
    "price": 16.08
  },
  {
    "title": "Meet Me at the Lake",
    "description": "Fern Brookbanks has wasted far too much of her adult life thinking about Will Baxter. She spent just twenty-four hours in her early twenties with the aggravatingly attractive, idealistic artist, a chance encounter that spiraled into a daylong adventure in Toronto. The timing was wrong, but their connection was undeniable: they shared every secret, every dream, and made a pact to meet one year later. Fern showed up. Will didn't.At thirty-two, Fern's life doesn't look at all how she once imagined it would. Instead of living in the city, Fern's back home, running her mother's Muskoka lakeside resort—something she vowed never to do. The place is in disarray, her ex-boyfriend's the manager, and Fern doesn't know where to begin.She needs a plan—a lifeline. To her surprise, it comes in the form of Will, who arrives nine years too late, with a suitcase in tow and an offer to help on his lips. Will may be the only person who understands what Fern's going through. But how could she possibly trust this expensive-suit wearing mirage who seems nothing like the young man she met all those years ago. Will is hiding something, and Fern's not sure she wants to know what it is.But ten years ago, Will Baxter rescued Fern. Can she do the same for him?",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1664246880i/61797464.jpg",
    "category": [
      "Romance",
      "Fiction",
      "Audiobook",
      "Contemporary",
      "Contemporary Romance",
      "Adult",
      "Chick Lit"
    ],
    "author": "Carley Fortune",
    "price": 15.36
  },
  {
    "title": "The True Love Experiment",
    "description": "Sparks fly when a romance novelist and a documentary filmmaker join forces to craft the perfect Hollywood love story and take both of their careers to the next level—but only if they can keep the chemistry between them from taking the whole thing off script.Felicity “Fizzy” Chen is lost. Sure, she’s got an incredible career as a beloved romance novelist with a slew of bestsellers under her belt, but when she’s asked to give a commencement address, it hits her: she hasn’t been practicing what she’s preached.Fizzy hasn’t ever really been in love. Lust? Definitely. But that swoon-worthy, can’t-stop-thinking-about-him, all-encompassing feeling? Nope. Nothing. What happens when the optimism she’s spent her career encouraging in readers starts to feel like a lie?Connor Prince, documentary filmmaker and single father, loves his work in large part because it allows him to live near his daughter. But when his profit-minded boss orders him to create a reality TV show, putting his job on the line, Connor is out of his element. Desperate to find his romantic lead, a chance run-in with an exasperated Fizzy offers Connor the perfect solution. What if he could show the queen of romance herself falling head-over-heels for all the world to see? Fizzy gives him a hard pass—unless he agrees to her list of demands. When he says yes, and production onThe True Love Experimentbegins, Connor wonders if that perfect match will ever be in the cue cards for him, too.The True Love Experimentis the book fans have been waiting for ever since Fizzy’s debut inThe Soulmate Equation. But when the lights come on and all eyes are on her, it turns out the happily ever after Fizzy had all but given up on might lie just behind the camera.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1677786623i/62361081.jpg",
    "category": [
      "Romance",
      "Contemporary",
      "Audiobook",
      "Fiction",
      "Contemporary Romance",
      "Adult",
      "Chick Lit"
    ],
    "author": "Christina Lauren",
    "price": 17.79
  },
  {
    "title": "Fourth Wing",
    "description": "Enter the brutal and elite world of a war college for dragon riders...Twenty-year-old Violet Sorrengail was supposed to enter the Scribe Quadrant, living a quiet life among books and history. Now, the commanding general—also known as her tough-as-talons mother—has ordered Violet to join the hundreds of candidates striving to become the elite of Navarre:dragon riders.But when you’re smaller than everyone else and your body is brittle, death is only a heartbeat away...because dragons don’t bond to “fragile” humans. They incinerate them.With fewer dragons willing to bond than cadets, most would kill Violet to better their own chances of success. The rest would kill her just for being her mother’s daughter—like Xaden Riorson, the most powerful and ruthless wingleader in the Riders Quadrant.She’ll need every edge her wits can give her just to see the next sunrise.Yet, with every day that passes, the war outside grows more deadly, the kingdom's protective wards are failing, and the death toll continues to rise. Even worse, Violet begins to suspect leadership is hiding a terrible secret.Friends, enemies, lovers. Everyone at Basgiath War College has an agenda—because once you enter, there are only two ways out:graduate or die",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1701980900i/61431922.jpg",
    "category": [
      "Dragons",
      "Fiction",
      "Romantasy",
      "Audiobook",
      "Fantasy Romance",
      "Magic",
      "New Adult"
    ],
    "author": "Rebecca Yarros",
    "price": 7.59
  },
  {
    "title": "Assistant to the Villain",
    "description": "Once Upon a TimemeetsThe Officein Hannah Maehrer’s laugh-out-loud viral TikTok series turned novel, about the sunshine assistant to an Evil Villain…and their unexpected romance.ASSISTANT WANTED:Notorious, high-ranking villain seeks loyal, levelheaded assistant for unspecified office duties, supporting staff for random mayhem, terror, and other Dark Things In General. Discretion a must. Excellent benefits.With ailing family to support, Evie Sage's employment status isn't just important, it's vital. So when a mishap with Rennedawn’s most infamous Villain results in a job offer—naturally, she says yes. No job is perfect, of course, but even less so when you develop a teeny crush on your terrifying, temperamental, and undeniably hot boss.Don’t find evil so attractive, Evie.But just when she’s getting used to severed heads suspended from the ceiling and the odd squish of an errant eyeball beneath her heel, Evie suspects this dungeon has a huge rat…and not just the literal kind. Because something rotten is growing in the kingdom of Rennedawn, and someone wants to take the Villain—and his entire nefarious empire—out.Now Evie must not only resist drooling over her boss but also figure out exactly who is sabotaging his work…and ensure he makes them pay.After all, a good job is hard to find.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1702057336i/123257687.jpg",
    "category": [
      "Fantasy",
      "Romance",
      "Audiobook",
      "Fiction",
      "Romantasy",
      "Fantasy Romance",
      "Magic"
    ],
    "author": "Hannah Nicole Maehrer",
    "price": 16.26
  },
  {
    "title": "The Ashes & the Star-Cursed King",
    "description": "Love is a sacrifice at the altar of power.In the wake of the Kejari, everything Oraya once thought to be true has been destroyed. A prisoner in her own kingdom, grieving the only family she ever had, and reeling from a gutting betrayal, she no longer even knows the truth of her own blood. She’s left only with one certainty: she cannot trust anyone, least of all Raihn.The House of Night, too, is surrounded by enemies. Raihn’s own nobles are none too eager to accept a Turned king, especially one who was once a slave. And the House of Blood digs their claws into the kingdom, threatening to tear it apart from the inside.When Raihn offers Oraya a secret alliance, taking the deal is her only chance at reclaiming her kingdom–and gaining her vengeance against the lover who betrayed her. But to do so, she’ll need to harness a devastating ancient power, intertwined with her father’s greatest secrets.But with enemies closing in on all sides, nothing is as it seems. As she unravels her past and faces her future, Oraya finds herself forced to choose between the bloody reality of seizing power – and the devastating love that could be her downfall.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1711665192i/62335396.jpg",
    "category": [
      "Fantasy",
      "Romance",
      "Romantasy",
      "Vampires",
      "Fantasy Romance",
      "Paranormal",
      "Magic"
    ],
    "author": "Carissa Broadbent",
    "price": 13.42
  },
  {
    "title": "Sorrow and Starlight",
    "description": "All stars must fall.Bloody, lost, broken. We live to fight another day. But with so much stolen from us, can the fates ever twist in our favour again?My sister and I have been torn apart by shadows and despair, and now we each stand alone.Our sorrow is spun like a web, trapping us tight, and I fear our enemies will soon come to feast upon our souls.But if I have my way, the merciless sky will have dealt us its final fortune. It’s time for us to take back the power that’s been ripped from our grasp and turn the tide of this war.All stars must fall, and all Phoenixes must rise.Long live the Savage Queens.*This will now be book 8 of 9 in the series****This is a dark, bully romance – don’t go expecting a sweet school for magic with friends around every corner. Fae fight for everything they own and Zodiac Academy is a cutthroat school for students aged 18+ where only the strongest prevail. There’s no Dumbledore here to save anyone’s ass and Lionel Acrux will give Voldemort a run for his money in the evil dictator category. So hold onto your stardust (broomsticks not required) and get ready for a bumpy ride***",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1664442356i/59808792.jpg",
    "category": [
      "Fantasy",
      "Romance",
      "Romantasy",
      "Fae",
      "Fantasy Romance",
      "Paranormal",
      "New Adult"
    ],
    "author": "Caroline Peckham",
    "price": 18.09
  },
  {
    "title": "Throne of the Fallen",
    "description": "Sinner. Villain. Wicked.The Prince of Envy has never claimed to be a saint. But when a cryptic note arrives, signaling the beginning of a deadly game, he knows it will take more than a hint of sin to win and save his falling demon court. Riddles, hexed objects, anonymous players, nothing will stand in his way, though none of his meticulous plans prepare him for her, the frustrating artist who ignites his sin like no other…Virtuous. Darling. Liar.The trouble with scoundrels and blackguards is that they haven’t a modicum of honor, a fact Miss Camilla Antonius learns after one desperate mistake allows Waverly Green’s most notorious rake to blackmail her. To avoid a ruinous scandal, Camilla is forced to enter a devil’s bargain with Envy, little expecting his game will awaken her true nature . . .Together, Envy and Camilla must embark on a perilous journey through the Underworld—from glittering demon courts to the sultry vampire realm and beyond—while trying to avoid the most dangerous trap of all: falling in love.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1673510962i/73071451.jpg",
    "category": [
      "Fantasy",
      "Romance",
      "Romantasy",
      "Fantasy Romance",
      "Adult",
      "Paranormal",
      "Fiction"
    ],
    "author": "Kerri Maniscalco",
    "price": 18.36
  },
  {
    "title": "The Hurricane Wars",
    "description": "The heart is a battlefield.All Talasyn has ever known is the Hurricane Wars. Growing up an orphan in a nation under siege by the ruthless Night Emperor, Talasyn has found her family among the soldiers who fight for freedom. But she is hiding a deadly secret: light magic courses through her veins, a blazing power believed to have been wiped out years ago that can cut through the Night Empire's shadows.Prince Alaric, the emperor's only son and heir, has been forged into a weapon by his father. Tasked with obliterating any threats to the Night Empire's rule with the strength of his armies and mighty Shadow magic, Alaric has never been bested. That is until he sees Talasyn burning brightly on the battlefield with the magic that killed his grandfather, turned his father into a monster, and ignited the Hurricane Wars. In a clash of light and dark, their powers merge and create a force the likes of which has never been seen.Talasyn and Alaric both know this war can only end with them. But a greater threat is coming, and the strange new magic they can create together could be the only way to overcome it. Thrust into an uneasy alliance, they will confront the secrets at the heart of the war and find, in each other, a searing passion--one that could save their world...or destroy it.An exquisite fantasy brimming with unforgettable characters, sizzling enemies-to-lovers romance, and richly drawn worlds,The Hurricane Warsmarks the breathtaking debut of an extraordinary new writer.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1681316893i/75668288.jpg",
    "category": [
      "Fantasy",
      "Romance",
      "Romantasy",
      "Fantasy Romance",
      "Adult",
      "Fiction",
      "Magic"
    ],
    "author": "Thea Guanzon",
    "price": 16.16
  },
  {
    "title": "The Jasad Heir",
    "description": "Ten years ago, the kingdom of Jasad burned. Its magic outlawed; its royal family murdered down to the last child. At least, that’s what Sylvia wants people to believe.The lost Heir of Jasad, Sylvia never wants to be found. She can’t think about how Nizahl’s armies laid waste to her kingdom and continue to hunt its people—not if she wants to stay alive. But when Arin, the Nizahl Heir, tracks a group of Jasadi rebels to her village, staying one step ahead of death gets trickier.In a moment of anger Sylvia’s magic is exposed, capturing Arin’s attention. Now, to save her life, Sylvia will have to make a deal with her greatest enemy. If she helps him lure the rebels, she’ll escape persecution.A deadly game begins. Sylvia can’t let Arin discover her identity even as hatred shifts into something more. Soon, Sylvia will have to choose between the life she wants and the one she left behind. The scorched kingdom is rising, and it needs a queen.In this Egyptian-inspired debut fantasy, a fugitive queen strikes a deadly bargain with her greatest enemy and finds herself embroiled in a complex game that could resurrect her scorched kingdom or leave it in ashes forever.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1671465519i/60581370.jpg",
    "category": [
      "Fantasy",
      "Romance",
      "Romantasy",
      "Adult",
      "Fantasy Romance",
      "Fiction",
      "Magic"
    ],
    "author": "Sara  Hashem",
    "price": 12.03
  },
  {
    "title": "A Game of Gods",
    "description": "Told in multiple POVs, A Game of Gods is the final installment in the Hades Saga by USA Today Bestselling author Scarlett St. Clair.Hades, God of the Dead, has finally made Persephone his in every way possible. With their wedding on the horizon, the couple should be ecstatic. But Demeter is wreaking havoc on their bliss by battering the whole of New Greece with erratic and dangerous weather. At the same time, Theseus continues with his agenda against the Gods, allying with the hate-group Triad in an effort to bring down all of Olympus.Hades refuses to allow anything to stop him from securing Persephone as his bride, but he must play a deep strategic game with the Gods of Olympus to safeguard their future. And it is not entirely clear which Gods are truly on his side.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1610057817i/56587784.jpg",
    "category": [
      "Romance",
      "Mythology",
      "Greek Mythology",
      "Romantasy",
      "Fantasy Romance",
      "Audiobook",
      "Fiction"
    ],
    "author": "Scarlett St.  Clair",
    "price": 7.97
  },
  {
    "title": "The Coven",
    "description": "Raised to be my father’s weapon against the Coven that took away his sister and his birthright, I would do anything to protect my younger brother from suffering the same fate. My duty forces me to the secret town of Crystal Hollow and the prestigious Hollow’s Grove University—where the best and brightest of my kind learn to practice their magic free from human judgment.There are no whispered words here. No condemnation for the blood that flows through my veins. The only animosity I face comes from the beautiful and infuriating Headmaster, Alaric Grayson Thorne, a man who despises me just as much as I loathe him and everything he stands for.But that doesn’t mean secrets don’t threaten to tear the school in two. No one talks about the bloody massacre that forced it to close decades prior, only the opportunity it can afford to those fortunate enough to attend.Because for the first time in fifty years, the Coven will open its wards to the Thirteen: thirteen promising students destined to change the world.If the ghosts of Hollow’s Groves’ victims don’t kill them first...The Coven is book one in the Coven of Bones series and ends on a cliffhanger. This is a gothic, dark-academia, paranormal romance and includes elements that may be triggering to some listeners.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1678470633i/75396525.jpg",
    "category": [
      "Fantasy",
      "Romance",
      "Paranormal",
      "Romantasy",
      "Witches",
      "Fantasy Romance",
      "Vampires"
    ],
    "author": "Harper L. Woods",
    "price": 10.85
  },
  {
    "title": "Hell Bent",
    "description": "Wealth. Power. Murder. Magic. Alex Stern is back and the Ivy League is going straight to hell.Find a gateway to the underworld. Steal a soul out of hell. A simple plan, except people who make this particular journey rarely come back. But Galaxy “Alex” Stern is determined to break Darlington out of purgatory―even if it costs her a future at Lethe and at Yale.Forbidden from attempting a rescue, Alex and Dawes can’t call on the Ninth House for help, so they assemble a team of dubious allies to save the gentleman of Lethe. Together, they will have to navigate a maze of arcane texts and bizarre artifacts to uncover the societies’ most closely guarded secrets, and break every rule doing it. But when faculty members begin to die off, Alex knows these aren’t just accidents. Something deadly is at work in New Haven, and if she is going to survive, she’ll have to reckon with the monsters of her past and a darkness built into the university’s very walls.Thick with history and packed with Bardugo’s signature twists,Hell Bentbrings to life an intricate world full of magic, violence, and all too real monsters.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1648744814i/60652997.jpg",
    "category": [
      "Fantasy",
      "Fiction",
      "Horror",
      "Mystery",
      "Urban Fantasy",
      "Paranormal",
      "Audiobook"
    ],
    "author": "Leigh Bardugo",
    "price": 16.33
  },
  {
    "title": "Tress of the Emerald Sea",
    "description": "#1New York Timesbestselling author Brandon Sanderson brings us deeper into the Cosmere universe with a rollicking, riveting tale that will appeal to fans ofThe Princess Bride.The only life Tress has known on her island home in an emerald-green ocean has been a simple one, with the simple pleasures of collecting cups brought by sailors from faraway lands and listening to stories told by her friend Charlie. But when his father takes him on a voyage to find a bride and disaster strikes, Tress must stow away on a ship and seek the Sorceress of the deadly Midnight Sea. Amid the spore oceans where pirates abound, can Tress leave her simple life behind and make her own place sailing a sea where a single drop of water can mean instant death?",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1675297784i/63068384.jpg",
    "category": [
      "Fantasy",
      "Fiction",
      "Romance",
      "Audiobook",
      "Young Adult",
      "Adventure",
      "High Fantasy"
    ],
    "author": "Brandon Sanderson",
    "price": 16.56
  },
  {
    "title": "A Day of Fallen Night",
    "description": "InA Day of Fallen Night,Samantha Shannon sweeps readers back to the universe ofPriory of the Orange Treeand into the lives of four women, showing us a course of events that shaped their world for generations to come.Tunuva Melim is a sister of the Priory. For fifty years, she has trained to slay wyrms – but none have appeared since the Nameless One, and the younger generation is starting to question the Priory's purpose.To the north, in the Queendom of Inys, Sabran the Ambitious has married the new King of Hróth, narrowly saving both realms from ruin. Their daughter, Glorian, trails in their shadow – exactly where she wants to be.The dragons of the East have slept for centuries. Dumai has spent her life in a Seiikinese mountain temple, trying to wake the gods from their long slumber. Now someone from her mother's past is coming to upend her fate.When the Dreadmount erupts, bringing with it an age of terror and violence, these women must find the strength to protect humankind from a devastating threat.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1675653942i/60766189.jpg",
    "category": [
      "Fantasy",
      "Fiction",
      "LGBT",
      "Queer",
      "Dragons",
      "Lesbian",
      "Adult"
    ],
    "author": "Samantha    Shannon",
    "price": 17.78
  },
  {
    "title": "Bookshops & Bonedust",
    "description": "When an injury throws a young, battle-hungry orc off her chosen path, she may find that what we need isn't always what we seek.InBookshops & Bonedust, a prequel toLegends & Lattes, author Travis Baldree takes us on a journey of high fantasy, first loves, and second-hand books.Viv's career with the notorious mercenary company Rackam's Ravens isn't going as planned.Wounded during the hunt for a powerful necromancer, she's packed off against her will to recuperate in the sleepy beach town of Murk—so far from the action that she worries she'll never be able to return to it.What's a thwarted soldier of fortune to do?Spending her hours at a beleaguered bookshop in the company of its foul-mouthed proprietor is the last thing Viv would have predicted, but it may be both exactly what she needs and the seed of changes she couldn't possibly imagine.Still, adventure isn't all that far away. A suspicious traveler in gray, a gnome with a chip on her shoulder, a summer fling, and an improbable number of skeletons prove Murk to be more eventful than Viv could have ever expected.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1678122626i/65213543.jpg",
    "category": [
      "Fantasy",
      "Fiction",
      "Audiobook",
      "Cozy Mystery",
      "LGBT",
      "Romance",
      "Queer"
    ],
    "author": "Travis Baldree",
    "price": 8.0
  },
  {
    "title": "The Fragile Threads of Power",
    "description": "From the #1New York Timesbestselling author ofThe Invisible Life of Addie LaRue, and set in the world ofA Darker Shade of Magic, V. E. Schwab opens a new door into perilous adventure and tangled schemes withThe Fragile Threads of Power.Once, there were four worlds, nestled like pages in a book, each pulsing with fantastical power, and connected by a single city: London. Until the magic grew too fast, and forced the worlds to seal the doors between them in a desperate gamble to protect their own. The few magicians who could still open the doors grew more rare as time passed and now, only three Antari are known in recent memory―Kell Maresh of Red London, Delilah Bard of Grey London, and Holland Vosijk, of White London.But barely a glimpse of them have been seen in the last seven years―and a new Antari named Kosika has appeared in White London, taking the throne in Holland's absence. The young queen is willing to feed her city with blood, including her own―but her growing religious fervor has the potential to drown them instead.And back in Red London, King Rhy Maresh is threatened by a rising rebellion, one determined to correct the balance of power by razing the throne entirely.Amidst this tapestry of old friends and new enemies, a girl with an unusual magical ability comes into possession of a device that could change the fate of all four worlds.Her name is Tes, and she's the only one who can bring them together―or unravel it all.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1678296412i/111673828.jpg",
    "category": [
      "Fantasy",
      "Fiction",
      "Adult",
      "Magic",
      "Audiobook",
      "Historical Fiction",
      "High Fantasy"
    ],
    "author": "Victoria Schwab",
    "price": 15.12
  },
  {
    "title": "Sword Catcher",
    "description": "In the vibrant city-state of Castellane, the richest of nobles and the most debauched of criminals have one thing in common: the constant search for wealth, power, and the next hedonistic thrill.Kel is an orphan, stolen from the life he knew to become the Sword Catcher—the body double of a royal heir, Prince Conor Aurelian. He has been raised alongside the prince, trained in every aspect of combat and statecraft. He and Conor are as close as brothers, but Kel knows that his destiny is to die for Conor. No other future is possible.Lin Caster is one of the Ashkar, a small community whose members still possess magical abilities. By law, they must live behind walls within the city, but Lin, a physician, ventures out to tend to the sick and dying of Castellane. Despite her skills, she cannot heal her best friend without access to forbidden knowledge.After a failed assassination attempt brings Lin and Kel together, they are drawn into the web of the mysterious Ragpicker King, the criminal ruler of Castellane’s underworld. He offers them each what they want most; but as they descend into his world of intrigue and shadow, they discover a conspiracy of corruption that reaches from the darkest gutters of Castellane to the highest tower of its palaces.As long-kept secrets begin to unravel, they must ask themselves: Is knowledge worth the price of betrayal? Can forbidden love bring down a kingdom? And will their discoveries plunge their nation into war—and the world into chaos?",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1674841074i/36679274.jpg",
    "category": [
      "Fantasy",
      "Romance",
      "Adult",
      "Young Adult",
      "Fiction",
      "Audiobook",
      "High Fantasy"
    ],
    "author": "Cassandra Clare",
    "price": 15.97
  },
  {
    "title": "Starling House",
    "description": "A grim and gothic new tale from author Alix E. Harrow about a small town haunted by secrets that can't stay buried and the sinister house that sits at the crossroads of it all.Eden, Kentucky, is just another dying, bad-luck town, known only for the legend of E. Starling, the reclusive nineteenth-century author and illustrator who wrote The Underland--and disappeared. Before she vanished, Starling House appeared. But everyone agrees that it’s best to let the uncanny house―and its last lonely heir, Arthur Starling―go to rot.Opal knows better than to mess with haunted houses or brooding men, but an unexpected job offer might be a chance to get her brother out of Eden. Too quickly, though, Starling House starts to feel dangerously like something she’s never had: a home.As sinister forces converge on Starling House, Opal and Arthur are going to have to make a dire choice to dig up the buried secrets of the past and confront their own fears, or let Eden be taken over by literal nightmares.If Opal wants a home, she’ll have to fight for it.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1718664072i/65213595.jpg",
    "category": [
      "Fantasy",
      "Horror",
      "Gothic",
      "Fiction",
      "Romance",
      "Mystery",
      "Audiobook"
    ],
    "author": "Alix E. Harrow",
    "price": 11.49
  },
  {
    "title": "The Unmaking of June Farrow",
    "description": "A woman risks everything to end her family’s centuries-old curse, solve her mother’s disappearance, and find love in this mesmerizing novel from the New York Times bestselling author of Spells for Forgetting.In the small mountain town of Jasper, North Carolina, June Farrow is waiting for fate to find her. The Farrow women are known for their thriving flower farm—and the mysterious curse that has plagued their family line. The whole town remembers the madness that led to Susanna Farrow’s disappearance, leaving June to be raised by her grandmother and haunted by rumors.It’s been a year since June started seeing and hearing things that weren’t there. Faint wind chimes, a voice calling her name, and a mysterious door appearing out of nowhere—the signs of what June always knew was coming. But June is determined to end the curse once and for all, even if she must sacrifice finding love and having a family of her own.After her grandmother’s death, June discovers a series of cryptic clues regarding her mother’s decades-old disappearance, except they only lead to more questions. But could the door she once assumed was a hallucination be the answer she’s been searching for? The next time it appears, June realizes she can touch it and walk past the threshold. And when she does, she embarks on a journey that will not only change both the past and the future, but also uncover the lingering mysteries of her small town and entangle her heart in an epic star-crossed love.With The Unmaking of June Farrow, Adrienne Young delivers a brilliant novel of romance, mystery, and a touch of the impossible—a story you will never forget.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1678126802i/66087062.jpg",
    "category": [
      "Fantasy",
      "Fiction",
      "Magical Realism",
      "Mystery",
      "Romance",
      "Time Travel",
      "Audiobook"
    ],
    "author": "Adrienne Young",
    "price": 18.41
  },
  {
    "title": "Stone Blind",
    "description": "A fresh take on the story of Medusa, the original monstered woman.They will fear you and flee you and call you a monster.The only mortal in a family of gods, Medusa is the youngest of the Gorgon sisters. Unlike her siblings, Medusa grows older, experiences change, feels weakness. Her mortal lifespan gives her an urgency that her family will never know.When the sea god Poseidon assaults Medusa in Athene's temple, the goddess is enraged. Furious by the violation of her sacred space, Athene takes revenge--on the young woman. Punished for Poseidon's actions, Medusa is forever transformed. Writhing snakes replace her hair and her gaze will turn any living creature to stone. Cursed with the power to destroy all she loves with one look, Medusa condemns herself to a life of solitude.Until Perseus embarks upon a fateful quest to fetch the head of a Gorgon...InStone Blind, classicist and comedian Natalie Haynes turns our understanding of this legendary myth on its head, bringing empathy and nuance to one of the earliest stories in which a woman--injured by a powerful man--is blamed, punished, and monstered for the assault. Delving into the origins of this mythic tale, Haynes revitalizes and reconstructs Medusa's story with her passion and fierce wit, offering a timely retelling of this classic myth that speaks to us today.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1664995844i/61102615.jpg",
    "category": [
      "Mythology",
      "Fantasy",
      "Greek Mythology",
      "Fiction",
      "Historical Fiction",
      "Retellings",
      "Audiobook"
    ],
    "author": "Natalie Haynes",
    "price": 11.25
  },
  {
    "title": "Ink Blood Sister Scribe",
    "description": "In this spellbinding debut novel, two estranged half-sisters tasked with guarding their family's library of magical books must work together to unravel a deadly secret at the heart of their collection--a tale of familial loyalty and betrayal, and the pursuit of magic and power.For generations, the Kalotay family has guarded a collection of ancient and rare books. Books that let a person walk through walls or manipulate the elements--books of magic that half-sisters Joanna and Esther have been raised to revere and protect.All magic comes with a price, though, and for years the sisters have been separated. Esther has fled to a remote base in Antarctica to escape the fate that killed her own mother, and Joanna's isolated herself in their family home in Vermont, devoting her life to the study of these cherished volumes. But after their father dies suddenly while reading a book Joanna has never seen before, the sisters must reunite to preserve their family legacy. In the process, they'll uncover a world of magic far bigger and more dangerous than they ever imagined, and all the secrets their parents kept hidden; secrets that span centuries, continents, and even other libraries . . .",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1685457125i/62854842.jpg",
    "category": [
      "Fantasy",
      "Fiction",
      "Magical Realism",
      "Audiobook",
      "Magic",
      "Books About Books",
      "Adult"
    ],
    "author": "Emma Törzs",
    "price": 9.27
  },
  {
    "title": "In the Lives of Puppets",
    "description": "In a strange little home built into the branches of a grove of trees, live three robots—fatherly inventor android Giovanni Lawson, a pleasantly sadistic nurse machine, and a small vacuum desperate for love and attention. Victor Lawson, a human, lives there too. They’re a family, hidden and safe.The day Vic salvages and repairs an unfamiliar android labelled “HAP,” he learns of a shared dark past between Hap and Gio–a past spent hunting humans.When Hap unwittingly alerts robots from Gio’s former life to their whereabouts, the family is no longer hidden and safe. Gio is captured and taken back to his old laboratory in the City of Electric Dreams. So together, the rest of Vic’s assembled family must journey across an unforgiving and otherworldly country to rescue Gio from decommission, or worse, reprogramming.Along the way to save Gio, amid conflicted feelings of betrayal and affection for Hap, Vic must decide for himself: Can he accept love with strings attached?Inspired by Carlo Collodi's The Adventures of Pinocchio, and like Swiss Family Robinson meets Wall-E, In the Lives of Puppets is a masterful stand-alone fantasy adventure from the beloved author who brought you The House in the Cerulean Sea and Under the Whispering Door.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1699617963i/60784549.jpg",
    "category": [
      "Fantasy",
      "Science Fiction",
      "Fiction",
      "LGBT",
      "Audiobook",
      "Romance",
      "Queer"
    ],
    "author": "T.J. Klune",
    "price": 9.14
  },
  {
    "title": "Light Bringer",
    "description": "Darrow returns as Pierce Brown’sNew York Timesbestselling Red Rising series continues in the thrilling sequel toDark Age.“The measure of a man is not the fear he sows in his enemies. It is the hope he gives his friends.”—Virginia au AugustusThe Reaper is a legend, more myth than man: the savior of worlds, the leader of the Rising, the breaker of chains.But the Reaper is also Darrow, born of the red soil of Mars: a husband, a father, a friend.The worlds once needed the Reaper. But now they need Darrow. Because after the dark age will come a new age: of light, of victory, of hope.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1667655583i/29227774.jpg",
    "category": [
      "Science Fiction",
      "Fantasy",
      "Fiction",
      "Audiobook",
      "Dystopia",
      "Space Opera",
      "Adult"
    ],
    "author": "Pierce Brown",
    "price": 19.94
  },
  {
    "title": "Starter Villain",
    "description": "Inheriting your uncle's supervillain business is more complicated than you might think. Particularly when you discover who's running the place.Charlie's life is going nowhere fast. A divorced substitute teacher living with his cat in a house his siblings want to sell, all he wants is to open a pub downtown, if only the bank will approve his loan.Then his long-lost uncle Jake dies and leaves his supervillain business (complete with island volcano lair) to Charlie.But becoming a supervillain isn't all giant laser death rays and lava pits. Jake had enemies, and now they're coming after Charlie. His uncle might have been a stand-up, old-fashioned kind of villain, but these are the real thing: rich, soulless predators backed by multinational corporations and venture capital.It's up to Charlie to win the war his uncle started against a league of supervillains. But with unionized dolphins, hyperintelligent talking spy cats, and a terrifying henchperson at his side, going bad is starting to look pretty good.In a dog-eat-dog world...be a cat.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1683564155i/61885029.jpg",
    "category": [
      "Science Fiction",
      "Fiction",
      "Fantasy",
      "Humor",
      "Audiobook",
      "Contemporary",
      "Adult"
    ],
    "author": "John Scalzi",
    "price": 13.34
  },
  {
    "title": "System Collapse",
    "description": "Am I making it worse? I think I'm making it worse.Everyone's favorite lethal SecUnit is back.Following the events inNetwork Effect, the Barish-Estranza corporation has sent rescue ships to a newly-colonized planet in peril, as well as additional SecUnits. But if there’s an ethical corporation out there, Murderbot has yet to find it, and if Barish-Estranza can’t have the planet, they’re sure as hell not leaving withoutsomething. If that something just happens to be an entire colony of humans, well, a free workforce is a decent runner-up prize.But there’s something wrong with Murderbot; it isn’t running within normal operational parameters. ART’s crew and the humans from Preservation are doing everything they can to protect the colonists, but with Barish-Estranza’s SecUnit-heavy persuasion teams, they’re going to have to hope Murderbot figures out what’s wrong with itself, and fast.Yeah, this plan is... not going to work.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1674575978i/65211701.jpg",
    "category": [
      "Science Fiction",
      "Audiobook",
      "Fiction",
      "Adult",
      "Science Fiction Fantasy",
      "Space",
      "Space Opera"
    ],
    "author": "Martha Wells",
    "price": 11.86
  },
  {
    "title": "Chain-Gang All-Stars",
    "description": "Two top women gladiators fight for their freedom within a depraved private prison system not so far-removed from America's own.Loretta Thurwar and Hamara \"Hurricane Staxxx\" Stacker are the stars of Chain-Gang All-Stars, the cornerstone of CAPE, or Criminal Action Penal Entertainment, a highly-popular, highly-controversial, profit-raising program in America's increasingly dominant private prison industry. It's the return of the gladiators and prisoners are competing for the ultimate prize: their freedom.In CAPE, prisoners travel as Links in Chain-Gangs, competing in death-matches for packed arenas with righteous protestors at the gates. Thurwar and Staxxx, both teammates and lovers, are the fan favorites. And if all goes well, Thurwar will be free in just a few matches, a fact she carries as heavily as her lethal hammer. As she prepares to leave her fellow Links, she considers how she might help preserve their humanity, in defiance of these so-called games, but CAPE's corporate owners will stop at nothing to protect their status quo and the obstacles they lay in Thurwar's path have devastating consequences.Moving from the Links in the field to the protestors to the CAPE employees and beyond,Chain-Gang All-Starsis a kaleidoscopic, excoriating look at the American prison system's unholy alliance of systemic racism, unchecked capitalism, and mass incarceration, and a clear-eyed reckoning with what freedom in this country really means.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1682956296i/61190770.jpg",
    "category": [
      "Fiction",
      "Science Fiction",
      "Dystopia",
      "Audiobook",
      "LGBT",
      "Fantasy",
      "Queer"
    ],
    "author": "Nana Kwame Adjei-Brenyah",
    "price": 14.65
  },
  {
    "title": "The Light Pirate",
    "description": "Set in the near future, this hopeful story of survival and resilience follows Wanda—a luminous child born out of a devastating hurricane—as she navigates a rapidly changing world.Florida is slipping away. As devastating weather patterns and rising sea levels wreak gradual havoc on the state’s infrastructure, a powerful hurricane approaches a small town on the southeastern coast. Kirby Lowe, an electrical line worker, his pregnant wife, Frida, and their two sons, Flip and Lucas, prepare for the worst. When the boys go missing just before the hurricane hits, Kirby heads out into the high winds in search of his children. Left alone, Frida goes into premature labor and gives birth to an unusual child, Wanda, whom she names after the catastrophic storm that ushers her into a society closer to collapse than ever before.As Florida continues to unravel, Wanda grows. Moving from childhood to adulthood, adapting not only to the changing landscape, but also to the people who stayed behind in a place abandoned by civilization, Wanda loses family, gains community, and ultimately, seeks adventure, love, and purpose in a place remade by nature.Told in four parts—power, water, light, and time— The Light Pirate mirrors the rhythms of the elements and the sometimes quick, sometimes slow dissolution of the world as we know it. It is a meditation on the changes we would rather not see, the future we would rather not greet, and a call back to the beauty and violence of an untamable wilderness.Includes a Reading Group Guide.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1663783151i/60468332.jpg",
    "category": [
      "Fiction",
      "Science Fiction",
      "Dystopia",
      "Magical Realism",
      "Audiobook",
      "Fantasy",
      "Literary Fiction"
    ],
    "author": "Lily Brooks-Dalton",
    "price": 19.93
  },
  {
    "title": "The Future",
    "description": "The bestselling, award-winning author ofThe Powerdelivers a dazzling tour de force where a handful of friends plot a daring heist to save the world from the tech giants whose greed threatens life as we know it.When Martha Einkorn fled her father’s isolated compound in Oregon, she never expected to find herself working for a powerful social media mogul hell-bent on controlling everything. Now, she’s surrounded by mega-rich companies designing private weather, predictive analytics, and covert weaponry, while spouting technological prophecy. Martha may have left the cult, but if the apocalyptic warnings in her father’s fox and rabbit sermon—once a parable to her—are starting to come true, how much future is actually left?Across the world, in a mall in Singapore, Lai Zhen, an internet-famous survivalist, flees from an assassin. She’s cornered, desperate, and—worst of all—might die without ever knowing what’s going on. Suddenly, a remarkable piece of software appears on her phone telling her exactly how to escape. Who made it? What is it really for? And if those behind it can save her from danger, what do they want from her, and what else do they know about the future?Martha and Zhen’s worlds are about to collide. An explosive chain of events is set in motion. While a few billionaires assured of their own safety lead the world to destruction, Martha’s relentless drive and Zhen’s insatiable curiosity could lead to something beautiful or the cataclysmic end of civilization.By turns “playful, incisive, horribly relevant, and surprisingly hopeful” (Lauren Beukes,New York Timesbestselling author ofThe Shining Girls),The Futureunfolds at breakneck speed, highlighting how power corrupts the few who have it and what it means to stand up to them. The future is coming.The Futureis here.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1678895127i/123163147.jpg",
    "category": [
      "Fiction",
      "Science Fiction",
      "Dystopia",
      "Audiobook",
      "Fantasy",
      "Speculative Fiction",
      "LGBT"
    ],
    "author": "Naomi Alderman",
    "price": 9.17
  },
  {
    "title": "Children of Memory",
    "description": "The modern classic of space opera that began with  Children of Time continues in this extraordinary novel of humanity's battle for survival on a terraformed planet.Earth failed. In a desperate bid to escape, the spaceship  Enkidu  and its captain, Heorest Holt, carried its precious human cargo to a potential new paradise. Generations later, this fragile colony has managed to survive, eking out a hardy existence. Yet life is tough, and much technological knowledge has been lost.Then strangers appear. They possess unparalleled knowledge and thrilling technology – and they've arrived from another world to help humanity’s colonies. But not all is as it seems, and the price of the strangers' help may be the colony itself.Children of Memory  by Arthur C. Clarke Award-winning author Adrian Tchaikovsky is a far-reaching space opera spanning generations, species and galaxies.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1655929496i/61030535.jpg",
    "category": [
      "Science Fiction",
      "Fiction",
      "Audiobook",
      "Space Opera",
      "Fantasy",
      "Space",
      "Aliens"
    ],
    "author": "Adrian Tchaikovsky",
    "price": 7.44
  },
  {
    "title": "Land of Milk and Honey",
    "description": "The award-winning author ofHow Much of These Hills Is Goldreturns with a rapturous and revelatory novel about a young chef whose discovery of pleasure alters her life and, indirectly, the worldA smog has spread. Food crops are rapidly disappearing. A chef escapes her dying career in a dreary city to take a job at a decadent mountaintop colony seemingly free of the world’s troubles.There, the sky is clear again. Rare ingredients abound. Her enigmatic employer and his visionary daughter have built a lush new life for the global elite, one that reawakens the chef to the pleasures of taste, touch, and her own body.In this atmosphere of hidden wonders and cool, seductive violence, the chef’s boundaries undergo a thrilling erosion. Soon she is pushed to the center of a startling attempt to reshape the world far beyond the plate.Sensuous and surprising, joyous and bitingly sharp, told in language as alluring as it is original,Land of Milk and Honeylays provocatively bare the ethics of seeking pleasure in a dying world. It is a daringly imaginative exploration of desire and deception, privilege and faith, and the roles we play to survive. Most of all, it is a love letter to food, to wild delight, and to the transformative power of a woman embracing her own appetite.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1683827919i/101673225.jpg",
    "category": [
      "Fiction",
      "Science Fiction",
      "Dystopia",
      "Audiobook",
      "Literary Fiction",
      "Food",
      "Contemporary"
    ],
    "author": "C Pam Zhang",
    "price": 17.44
  },
  {
    "title": "The Deep Sky",
    "description": "Yume Kitasei'sThe Deep Skyis an enthralling sci fi thriller debut about a mission into deep space that begins with a lethal explosion that leaves the survivors questioning the loyalty of the crew.They left Earth to save humanity. They’ll have to save themselves first.It is the eve of Earth’s environmental collapse. A single ship carries humanity’s last hope: eighty elite graduates of a competitive program, who will give birth to a generation of children in deep space. But halfway to a distant but livable planet, a lethal bomb kills three of the crew and knocks The Phoenix off course. Asuka, the only surviving witness, is an immediate suspect.Asuka already felt like an impostor before the explosion. She was the last picked for the mission, she struggled during training back on Earth, and she was chosen to represent Japan, a country she only partly knows as a half-Japanese girl raised in America. But estranged from her mother back home, The Phoenix is all she has left.With the crew turning on each other, Asuka is determined to find the culprit before they all lose faith in the mission—or worse, the bomber strikes again.---CW: miscarriage, fertility issues, terrorism, death of a child, racism, gore, strong language",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1675082851i/61884842.jpg",
    "category": [
      "Science Fiction",
      "Mystery",
      "Fiction",
      "Thriller",
      "Audiobook",
      "Space",
      "Mystery Thriller"
    ],
    "author": "Yume Kitasei",
    "price": 17.96
  },
  {
    "title": "Holly",
    "description": "Holly Gibney, one of Stephen King’s most compelling and ingeniously resourceful characters, returns in this thrilling novel to solve the gruesome truth behind multiple disappearances in a midwestern town.“Sometimes the universe throws you a rope.”— BILL HODGESStephen King’s Holly marks the triumphant return of beloved King character Holly Gibney. Readers have witnessed Holly’s gradual transformation from a shy (but also brave and ethical) recluse in Mr. Mercedes to Bill Hodges’s partner in Finders Keepers to a full-fledged, smart, and occasionally tough private detective in The Outsider. In King’s new novel, Holly is on her own, and up against a pair of unimaginably depraved and brilliantly disguised adversaries.When Penny Dahl calls the Finders Keepers detective agency hoping for help locating her missing daughter, Holly is reluctant to accept the case. Her partner, Pete, has Covid. Her (very complicated) mother has just died. And Holly is meant to be on leave. But something in Penny Dahl’s desperate voice makes it impossible for Holly to turn her down.Mere blocks from where Bonnie Dahl disappeared live Professors Rodney and Emily Harris. They are the picture of bourgeois respectability: married octogenarians, devoted to each other, and semi-retired lifelong academics. But they are harboring an unholy secret in the basement of their well-kept, book-lined home, one that may be related to Bonnie’s disappearance. And it will prove nearly impossible to discover what they are up to: they are savvy, they are patient, and they are ruthless.Holly must summon all her formidable talents to outthink and outmaneuver the shockingly twisted professors in this chilling new masterwork from Stephen King.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1674418461i/65916344.jpg",
    "category": [
      "Horror",
      "Thriller",
      "Fiction",
      "Mystery",
      "Audiobook",
      "Crime",
      "Mystery Thriller"
    ],
    "author": "Stephen         King",
    "price": 13.15
  },
  {
    "title": "How to Sell a Haunted House",
    "description": "Grady Hendrix takes on the haunted house in a thrilling new novel that explores the way your past—and your family—can haunt you like nothing else.When Louise finds out her parents have died, she dreads going home. She doesn’t want to leave her daughter with her ex and fly to Charleston. She doesn’t want to deal with her family home, stuffed to the rafters with the remnants of her father’s academic career and her mother’s lifelong obsession with puppets and dolls. She doesn’t want to learn how to live without the two people who knew and loved her best in the world.Most of all, she doesn’t want to deal with her brother, Mark, who never left their hometown, gets fired from one job after another, and resents her success. Unfortunately, she’ll need his help to get the house ready for sale because it’ll take more than some new paint on the walls and clearing out a lifetime of memories to get this place on the market.But some houses don’t want to be sold, and their home has other plans for both of them…",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1650818993i/59414094.jpg",
    "category": [
      "Horror",
      "Fiction",
      "Thriller",
      "Audiobook",
      "Paranormal",
      "Mystery",
      "Adult"
    ],
    "author": "Grady Hendrix",
    "price": 8.73
  },
  {
    "title": "A House with Good Bones",
    "description": "A haunting Southern Gothic from an award-winning master of suspense,A House With Good Bonesexplores the dark, twisted roots lurking just beneath the veneer of a perfect home and family.\"Mom seems off.\"Her brother's words echo in Sam Montgomery's ear as she turns onto the quiet North Carolina street where their mother lives alone.She brushes the thought away as she climbs the front steps. Sam's excited for this rare extended visit, and looking forward to nights with just the two of them, drinking boxed wine, watching murder mystery shows, and guessing who the killer is long before the characters figure it out.But stepping inside, she quickly realizes home isn’t what it used to be. Gone is the warm, cluttered charm her mom is known for; now the walls are painted a sterile white. Her mom jumps at the smallest noises and looks over her shoulder even when she’s the only person in the room. And when Sam steps out back to clear her head, she finds a jar of teeth hidden beneath the magazine-worthy rose bushes, and vultures are circling the garden from above.To find out what’s got her mom so frightened in her own home, Sam will go digging for the truth. But some secrets are better left buried.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1664972416i/60784409.jpg",
    "category": [
      "Horror",
      "Fantasy",
      "Fiction",
      "Gothic",
      "Audiobook",
      "Mystery",
      "Paranormal"
    ],
    "author": "T. Kingfisher",
    "price": 12.71
  },
  {
    "title": "Rouge",
    "description": "From the critically acclaimed author of Bunny comes a horror-tinted, gothic fairy tale about a lonely dress shop clerk whose mother’s unexpected death sends her down a treacherous path in pursuit of youth and beauty. Can she escape her mother’s fate—and find a connection that is more than skin deep?For as long as she can remember, Belle has been insidiously obsessed with her skin and skincare videos. When her estranged mother Noelle mysteriously dies, Belle finds herself back in Southern California, dealing with her mother’s considerable debts and grappling with lingering questions about her death. The stakes escalate when a strange woman in red appears at the funeral, offering a tantalizing clue about her mother’s demise, followed by a cryptic video about a transformative spa experience. With the help of a pair of red shoes, Belle is lured into the barbed embrace of La Maison de Méduse, the same lavish, culty spa to which her mother was devoted. There, Belle discovers the frightening secret behind her (and her mother’s) obsession with the mirror—and the great shimmering depths (and demons) that lurk on the other side of the glass.Snow White meets Eyes Wide Shut in this surreal descent into the dark side of beauty, envy, grief, and the complicated love between mothers and daughters. With black humor and seductive horror, Rouge explores the cult-like nature of the beauty industry—as well as the danger of internalizing its pitiless gaze. Brimming with California sunshine and blood-red rose petals, Rouge holds up a warped mirror to our relationship with mortality, our collective fixation with the surface, and the wondrous, deep longing that might lie beneath.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1684423250i/157184735.jpg",
    "category": [
      "Horror",
      "Fiction",
      "Fantasy",
      "Gothic",
      "Contemporary",
      "Literary Fiction",
      "Audiobook"
    ],
    "author": "Mona Awad",
    "price": 14.8
  },
  {
    "title": "My Darling Girl",
    "description": "A spine-tingling psychological thriller about a woman who, after taking in her dying, alcoholic mother, begins to suspect demonic possession is haunting her family.Alison has never been a fan of Christmas. But with it right around the corner and her husband busily decorating their cozy Vermont home, she has no choice but to face it. Then she gets the call.Mavis, Alison’s estranged mother, has been diagnosed with cancer and has only weeks to live. She wants to spend her remaining days with her daughter, son-in-law, and two granddaughters. But Alison grew up with her mother’s alcoholism and violent abuse and is reluctant to unearth these traumatic memories. Still, she eventually agrees to take in Mavis, hoping that she and her mother could finally heal and have the relationship she’s always dreamed of.But when mysterious and otherworldly things start happening upon Mavis’s arrival, Alison begins to suspect her mother is not quite who she seems. And as the holiday festivities turn into a nightmare, she must confront just how far she is willing to go to protect her family.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1688658775i/101145269.jpg",
    "category": [
      "Horror",
      "Thriller",
      "Fiction",
      "Mystery",
      "Audiobook",
      "Mystery Thriller",
      "Paranormal"
    ],
    "author": "Jennifer  McMahon",
    "price": 12.99
  },
  {
    "title": "The September House",
    "description": "A woman is determined to stay in her dream home even after it becomes a haunted nightmare in this compulsively readable, twisty, and layered debut novel.When Margaret and her husband Hal bought the large Victorian house on Hawthorn Street—for sale at a surprisingly reasonable price—they couldn’t believe they finally had a home of their own. Then they discovered the hauntings. Every September, the walls drip blood. The ghosts of former inhabitants appear, and all of them are terrified of something that lurks in the basement. Most people would flee.Margaret is not most people.Margaret is staying. It’sherhouse. But after four years Hal can’t take it anymore, and he leaves abruptly. Now, he’s not returning calls, and their daughter Katherine—who knows nothing about the hauntings—arrives, intent on looking for her missing father. To make things worse, September has just begun, and with every attempt Margaret and Katherine make at finding Hal, the hauntings grow more harrowing, because there are some secrets the house needs to keep.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1686576214i/64623481.jpg",
    "category": [
      "Horror",
      "Thriller",
      "Fiction",
      "Paranormal",
      "Audiobook",
      "Mystery",
      "Adult"
    ],
    "author": "Carissa Orlando",
    "price": 16.58
  },
  {
    "title": "Our Share of Night",
    "description": "A woman’s mysterious death puts her husband and son on a collision course with her demonic family.A young father and son set out on a road trip, devastated by the death of the wife and mother they both loved. United in grief, the pair travel to her ancestral home, where they must confront the terrifying legacy she has bequeathed: a family called the Order that commits unspeakable acts in search of immortality.For Gaspar, the son, this maniacal cult is his destiny. As the Order tries to pull him into their evil, he and his father take flight, attempting to outrun a powerful clan that will do anything to ensure its own survival. But how far will Gaspar’s father go to protect his child? And can anyone escape their fate?Moving back and forth in time, from London in the swinging 1960s to the brutal years of Argentina’s military dictatorship and its turbulent aftermath, Our Share of Night is a novel like no other: a family story, a ghost story, a story of the occult and the supernatural, a book about the complexities of love and longing with queer subplots and themes. This is the masterwork of one of Latin America’s most original novelists, “a mesmerizing writer,” says Dave Eggers, “who demands to be read.”",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660429329i/61111034.jpg",
    "category": [
      "Horror",
      "Fiction",
      "Fantasy",
      "Historical Fiction",
      "LGBT",
      "Queer",
      "Adult"
    ],
    "author": "Mariana Enríquez",
    "price": 11.99
  },
  {
    "title": "Lone Women",
    "description": "Blue skies, empty land—and enough wide-open space to hide a horrifying secret. A woman with a past, a mysterious trunk, a town on the edge of nowhere, and an “absorbing, powerful” ( BuzzFeed ) new vision of the American West, from the award-winning author of The Changeling .Adelaide Henry carries an enormous steamer trunk with her wherever she goes. It’s locked at all times. Because when the trunk opens, people around Adelaide start to disappear.The year is 1915, and Adelaide is in trouble. Her secret sin killed her parents, forcing her to flee California in a hellfire rush and make her way to Montana as a homesteader. Dragging the trunk with her at every stop, she will become one of the “lone women” taking advantage of the government’s offer of free land for those who can tame it—except that Adelaide isn’t alone. And the secret she’s tried so desperately to lock away might be the only thing that will help her survive the harsh territory.Crafted by a modern master of magical suspense, Lone Women blends shimmering prose, an unforgettable cast of adventurers who find horror and sisterhood in a brutal landscape, and a portrait of early-twentieth-century America like you’ve never seen. And at its heart is the gripping story of a woman desperate to bury her past—or redeem it.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1673265868i/60460704.jpg",
    "category": [
      "Horror",
      "Historical Fiction",
      "Fiction",
      "Fantasy",
      "Historical",
      "Audiobook",
      "Westerns"
    ],
    "author": "Victor LaValle",
    "price": 12.07
  },
  {
    "title": "Black Sheep",
    "description": "A cynical twentysomething must confront her unconventional family’s dark secrets in this fiery, irreverent horror novel from the author of Such Sharp Teeth and Cackle.Nobody has a “normal” family, but Vesper Wright’s is truly...something else. Vesper left home at eighteen and never looked back—mostly because she was told that leaving the staunchly religious community she grew up in meant she couldn’t return. But then an envelope arrives on her doorstep.Inside is an invitation to the wedding of Vesper’s beloved cousin Rosie. It’s to be hosted at the family farm. Have they made an exception to the rule? It wouldn’t be the first time Vesper’s been given special treatment. Is the invite a sweet gesture? An olive branch? A trap? Doesn’t matter. Something inside her insists she go to the wedding. Even if it means returning to the toxic environment she escaped. Even if it means reuniting with her mother, Constance, a former horror film star and forever ice queen.When Vesper’s homecoming exhumes a terrifying secret, she’s forced to reckon with her family’s beliefs and her own crisis of faith in this deliciously sinister novel that explores the way family ties can bind us as we struggle to find our place in the world.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1680293749i/69704909.jpg",
    "category": [
      "Horror",
      "Fiction",
      "Thriller",
      "Audiobook",
      "Mystery",
      "Adult",
      "Contemporary"
    ],
    "author": "Rachel   Harrison",
    "price": 10.21
  },
  {
    "title": "Don't Fear the Reaper",
    "description": "Jade returns to the rural lake town of Proofrock the same day as convicted Indigenous serial killer Dark Mill South escapes into town to complete his revenge killings, in this riveting sequel toMy Heart Is a ChainsawfromNew York Timesbestselling author Stephen Graham Jones.Four years after her tumultuous senior year, Jade Daniels is released from prison right before Christmas when her conviction is overturned. But life beyond bars takes a dangerous turn as soon as she returns to Proofrock. Convicted Serial Killer, Dark Mill South, seeking revenge for thirty-eight Dakota men hanged in 1862, escapes from his prison transfer due to a blizzard, just outside of Proofrock, Idaho.Dark Mill South’s Reunion Tour began on December 12th, 2019, a Thursday.Thirty-six hours and twenty bodies later, on Friday the 13th, it would be over.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1673499594i/59366246.jpg",
    "category": [
      "Horror",
      "Fiction",
      "Thriller",
      "Audiobook",
      "Mystery",
      "Adult",
      "Indigenous"
    ],
    "author": "Stephen Graham Jones",
    "price": 16.43
  },
  {
    "title": "Divine Rivals",
    "description": "When two young rival journalists find love through a magical connection, they must face the depths of hell, in a war among gods, to seal their fate forever.After centuries of sleep, the gods are warring again. But eighteen-year-old Iris Winnow just wants to hold her family together. Her mother is suffering from addiction and her brother is missing from the front lines. Her best bet is to win the columnist promotion at the Oath Gazette.To combat her worries, Iris writes letters to her brother and slips them beneath her wardrobe door, where they vanish―into the hands of Roman Kitt, her cold and handsome rival at the paper. When he anonymously writes Iris back, the two of them forge a connection that will follow Iris all the way to the front lines of battle: for her brother, the fate of mankind, and love.Shadow and Bone meets Lore in this epic enemies-to-lovers fantasy novel filled with hope and heartbreak, and the unparalleled power of love.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1655928079i/60784546.jpg",
    "category": [
      "Romance",
      "Young Adult",
      "Fantasy",
      "Romantasy",
      "Fiction",
      "Audiobook",
      "Historical Fiction"
    ],
    "author": "Rebecca   Ross",
    "price": 7.82
  },
  {
    "title": "A Curse for True Love",
    "description": "Two villains, one girl, and a deadly battle for happily ever after.Evangeline Fox ventured to the Magnificent North in search of her happy ending, and it seems as if she has it. She’s married to a handsome prince and lives in a legendary castle. But Evangeline has no idea of the devastating price she’s paid for this fairytale. She doesn’t know what she has lost, and her husband is determined to make sure she never finds out . . . but first he must kill Jacks, the Prince of Hearts.Blood will be shed, hearts will be stolen, and true love will be put to the test inA Curse for True Love, the breathlessly anticipated conclusion to the Once Upon A Broken Heart trilogy.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1674501506i/62816044.jpg",
    "category": [
      "Fantasy",
      "Romance",
      "Young Adult",
      "Romantasy",
      "Fantasy Romance",
      "Magic",
      "Fiction"
    ],
    "author": "Stephanie Garber",
    "price": 13.26
  },
  {
    "title": "The Stolen Heir",
    "description": "A runaway queen. A reluctant prince. And a quest that may destroy them both.Eight years have passed since the Battle of the Serpent. But in the icy north, Lady Nore of the Court of Teeth has reclaimed the Ice Needle Citadel. There, she is using an ancient relic to create monsters of stick and snow who will do her bidding and exact her revenge.Suren, child queen of the Court of Teeth, and the one person with power over her mother, fled to the human world. There, she lives feral in the woods. Lonely, and still haunted by the merciless torments she endured in the Court of Teeth, she bides her time by releasing mortals from foolish bargains. She believes herself forgotten until the storm hag, Bogdana chases her through the night streets. Suren is saved by none other than Prince Oak, heir to Elfhame, to whom she was once promised in marriage and who she has resented for years.Now seventeen, Oak is charming, beautiful, and manipulative. He’s on a mission that will lead him into the north, and he wants Suren’s help. But if she agrees, it will mean guarding her heart against the boy she once knew and a prince she cannot trust, as well as confronting all the horrors she thought she left behind.#1New York Timesbestselling author Holly Black returns to the opulent world of Elfhame in the first book in a thrilling new duology, following Jude's brother Oak, and the changeling queen, Suren.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1654625328i/61198133.jpg",
    "category": [
      "Young Adult",
      "Romance",
      "Fae",
      "Young Adult Fantasy",
      "Fiction",
      "Audiobook",
      "Magic"
    ],
    "author": "Holly Black",
    "price": 17.15
  },
  {
    "title": "Powerless",
    "description": "She is the very thing he’s spent his whole life hunting.He is the very thing she’s spent her whole life pretending to be.Only the extraordinary belong in the kingdom of Ilya—the exceptional, the empowered, the Elites.The powers these Elites have possessed for decades were graciously gifted to them by the Plague, though not all were fortunate enough to both survive the sickness and reap the reward. Those born Ordinary are just that—ordinary. And when the king decreed that all Ordinaries be banished in order to preserve his Elite society, lacking an ability suddenly became a crime—making Paedyn Gray a felon by fate and a thief by necessity.Surviving in the slums as an Ordinary is no simple task, and Paedyn knows this better than most. Having been trained by her father to be overly observant since she was a child, Paedyn poses as a Psychic in the crowded city, blending in with the Elites as best she can in order to stay alive and out of trouble. Easier said than done.When Paeydn unsuspectingly saves one of Ilyas princes, she finds herself thrown into the Purging Trials. The brutal competition exists to showcase the Elites’ powers—the very thing Paedyn lacks. If the Trials and the opponents within them don’t kill her, the prince she’s fighting feelings for certainly will if he discovers what she is—completely Ordinary.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1687711910i/153283393.jpg",
    "category": [
      "Fantasy",
      "Romance",
      "Romantasy",
      "Young Adult",
      "Fantasy Romance",
      "Fiction",
      "Audiobook"
    ],
    "author": "Lauren  Roberts",
    "price": 16.56
  },
  {
    "title": "What the River Knows",
    "description": "Bolivian-Argentinian Inez Olivera belongs to the glittering upper society of nineteenth century Buenos Aires, and like the rest of the world, the town is steeped in old world magic that’s been largely left behind or forgotten. Inez has everything a girl might want, except for the one thing she yearns the most: her globetrotting parents—who frequently leave her behind.When she receives word of their tragic deaths, Inez inherits their massive fortune and a mysterious guardian, an archeologist in partnership with his Egyptian brother-in-law. Yearning for answers, Inez sails to Cairo, bringing her sketch pads and an ancient golden ring her father sent to her for safekeeping before he died. But upon her arrival, the old world magic tethered to the ring pulls her down a path where she soon discovers there’s more to her parent’s disappearance than what her guardian led her to believe.With her guardian’s infuriatingly handsome assistant thwarting her at every turn, Inez must rely on ancient magic to uncover the truth about her parent’s disappearance—or risk becoming a pawn in a larger game that will kill her.The MummymeetsDeath on the Nilein this lush, immersive historical fantasy set in Egypt filled with adventure, a rivals-to-lovers romance, and a dangerous race.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1674234543i/65213381.jpg",
    "category": [
      "Fantasy",
      "Historical Fiction",
      "Young Adult",
      "Romance",
      "Mystery",
      "Fiction",
      "Historical"
    ],
    "author": "Isabel Ibañez",
    "price": 17.79
  },
  {
    "title": "A Study in Drowning",
    "description": "Effy Sayre has always believed in fairy tales. Haunted by visions of the Fairy King since childhood, she’s had no choice. Her tattered copy ofAngharad—Emrys Myrddin’s epic about a mortal girl who falls in love with the Fairy King, then destroys him—is the only thing keeping her afloat. So when Myrddin’s family announces a contest to redesign the late author’s estate, Effy feels certain it’s her destiny.But musty, decrepit Hiraeth Manor is an impossible task, and its residents are far from welcoming. Including Preston Héloury, a stodgy young literature scholar determined to expose Myrddin as a fraud. As the two rivals piece together clues about Myrddin’s legacy, dark forces, both mortal and magical, conspire against them—and the truth may bring them both to ruin.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1675782203i/75302266.jpg",
    "category": [
      "Fantasy",
      "Young Adult",
      "Gothic",
      "Mystery",
      "Fiction",
      "Audiobook",
      "Young Adult Fantasy"
    ],
    "author": "Ava Reid",
    "price": 10.35
  },
  {
    "title": "These Infinite Threads",
    "description": "With the heat of a kiss, the walls between Alizeh, the long-lost heir to an ancient Jinn kingdom, and Kamran, the crown prince of the Ardunian empire, have crumbled. And so have both of their lives.Alizeh, the heir to the Jinn throne, is destined to free her people from the half-lives they’ve been forced to live under human rule. When Kamran, the heir to the human throne, falls in love with her, he’s forced to question everything he’s been taught about Jinn.Kamran’s grandfather lays dead at the hand of Cyrus, ruler of the neighboring kingdom of Tulan. Cyrus has stolen Alizeh away to his homeland and plans to marry her there, giving her everything she needs to become the Jinn queen—and when she assumes the throne he will have fulfilled his own bargain with the devil.Alizeh wants nothing to do with Cyrus’s deal or the devil. But without a way to escape Tulan, and with the fulfillment of her own destiny tantalizingly close, she’ll have to decide whether she can set aside her emotions to become the queen her people need.Kamran, meanwhile, is picking up the pieces in Ardunia. Facing betrayal at every turn, all he knows is that he must go to Tulan to avenge his grandfather. He can only hope that Alizeh will be waiting for him there—and that she hasn’t yet become the queen of Tulan.Full of explosive magic, searing romance, and heartbreaking betrayal, this breathtaking sequel toThis Woven Kingdomis from the award-winning and bestselling author of theShatter Meseries and is perfect for fans of Leigh Bardugo, Sabaa Tahir, and Tomi Adeyemi.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1656264223i/61085769.jpg",
    "category": [
      "Fantasy",
      "Young Adult",
      "Romance",
      "Fantasy Romance",
      "Audiobook",
      "Romantasy",
      "Young Adult Fantasy"
    ],
    "author": "Tahereh Mafi",
    "price": 17.11
  },
  {
    "title": "Foul Heart Huntsman",
    "description": "Winter is drawing thick in 1932 Shanghai, as is the ever-nearing threat of a Japanese invasion.Rosalind Lang has suffered the worst possible fate for a national spy: she’s been exposed. With the media storm camped outside her apartment for the infamous Lady Fortune, she’s barely left her bedroom in weeks, plotting her next course of action after Orion was taken and his memories of Rosalind wiped. Though their marriage might have been a sham, his absence hurts her more than any physical wound. She won’t rest until she gets him back.But with her identity in the open, the task is near impossible. The only way to leave the city and rescue Orion is under the guise of a national tour. It’s easy to convince her superiors that the countryside needs unity more than ever, and who better than an immortal girl to stir pride and strength into the people?When the tour goes wrong, however, everything Rosalind once knew is thrown up in the air. Taking refuge outside Shanghai, old ghosts come into the open and adversaries turn to allies. To save Orion, they must find a cure to his mother’s traitorous invention and take this dangerous chemical weapon away from impending foreign invasion—but the clock is ticking, and if Rosalind fails, it’s not only Orion she loses, but her nation itself.From the #1New York Timesbestselling author ofThese Violent DelightsandOur Violent Endscomes the second book in the captivating Foul Lady Fortune duology following an immortal assassin in 1930s Shanghai as she races to save her country and her love.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1678293837i/101138075.jpg",
    "category": [
      "Fantasy",
      "Historical Fiction",
      "Romance",
      "Young Adult",
      "Historical",
      "Mystery",
      "Fiction"
    ],
    "author": "Chloe Gong",
    "price": 15.11
  },
  {
    "title": "Song of Silver, Flame Like Night",
    "description": "In a fallen kingdom, one girl carries the key to discovering the secrets of her nation’s past—and unleashing the demons that sleep at its heart. An epic fantasy series inspired by the mythology and folklore of ancient China.Once, Lan had a different name. Now she goes by the one the Elantian colonizers gave her when they invaded her kingdom, killed her mother, and outlawed her people’s magic. She spends her nights as a songgirl in Haak’gong, a city transformed by the conquerors, and her days scavenging for what she can find of the past. Anything to understand the strange mark burned into her arm by her mother in her last act before she died.The mark is mysterious—an untranslatable Hin character—and no one but Lan can see it. Until the night a boy appears at her teahouse and saves her life.Zen is a practitioner—one of the fabled magicians of the Last Kingdom. Their magic was rumored to have been drawn from the demons they communed with. Magic believed to be long lost. Now it must be hidden from the Elantians at all costs.When Zen comes across Lan, he recognizes what she is: a practitioner with a powerful ability hidden in the mark on her arm. He’s never seen anything like it—but he knows that if there are answers, they lie deep in the pine forests and misty mountains of the Last Kingdom, with an order of practitioning masters planning to overthrow the Elantian regime.Both Lan and Zen have secrets buried deep within—secrets they must hide from others, and secrets that they themselves have yet to discover. Fate has connected them, but their destiny remains unwritten. Both hold the power to liberate their land. And both hold the power to destroy the world.Now the battle for the Last Kingdom begins.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1661410548i/58303740.jpg",
    "category": [
      "Fantasy",
      "Young Adult",
      "Mythology",
      "Romance",
      "Young Adult Fantasy",
      "Dragons",
      "Fiction"
    ],
    "author": "Amélie Wen Zhao",
    "price": 8.52
  },
  {
    "title": "Delicious Monsters",
    "description": "The Haunting of Hill HousemeetsSadiein this evocative and mind-bending psychological thriller following two teen girls navigating the treacherous past of a mysterious mansion ten years apart.Daisy sees dead people—something impossible to forget in bustling, ghost-packed Toronto. She usually manages to deal with her unwanted ability, but she’s completely unprepared to be dumped by her boyfriend. So when her mother inherits a secluded mansion in northern Ontario where she spent her childhood summers, Daisy jumps at the chance to escape. But the house is nothing like Daisy expects, and she begins to realize that her experience with the supernatural might be no match for her mother’s secrets, nor what lurks within these walls…A decade later, Brittney is desperate to get out from under the thumb of her abusive mother, a bestselling author who claims her stay at “Miracle Mansion” allowed her to see the error of her ways. But Brittney knows that’s nothing but a sham. She decides the new season of her popularHauntedweb series will uncover what happened to a young Black girl in the mansion ten years prior and finally expose her mother’s lies. But as she gets more wrapped up in the investigation, she’ll have to decide: if she can only bring one story to light, which one matters most—Daisy’s or her own?As Brittney investigates the mansion in the present, Daisy’s story runs parallel in the past, both timelines propelling the girls to face the most dangerous monsters of all: those that hide in plain sight.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1675288895i/61273084.jpg",
    "category": [
      "Horror",
      "Young Adult",
      "Fantasy",
      "Mystery",
      "Thriller",
      "Paranormal",
      "Fiction"
    ],
    "author": "Liselle Sambury",
    "price": 14.46
  },
  {
    "title": "Check & Mate",
    "description": "Mallory Greenleaf isdonewith chess. Every move counts nowadays. After the sport led to the destruction of her family four years earlier, Mallory's focus is on her mom, her sisters, and the dead-end job that keeps the lights on. That is, until she begrudgingly agrees to play in one last charity tournament and inadvertently wipes the board with notorious \"Kingkiller\" Nolan Sawyer: current world champion and reigning bad boy of chess.Nolan's loss to an unknown rook-ie shocks everyone—especially Mallory. What's even more confusing? His desire to cross pawns again. What kind of gambit is Nolan playing? The smart move would be to walk away. Resign. Game over. But Mallory's victory opens the door to sorely needed cash prizes and, despite everything, she can't help feeling drawn to the enigmatic strategist....As she rockets up the ranks, Mallory struggles to keep her family safely separated from the game that wrecked it in the first place. And as her love for the sport she so desperately wanted to hate begins to rekindle, Mallory quickly realizes that the games aren't only on the board, the spotlight is hotter than she imagined, and the competition can be fierce(-ly attractive. And intelligent...and infuriating...)",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1678378842i/60683957.jpg",
    "category": [
      "Young Adult",
      "Contemporary",
      "Fiction",
      "Audiobook",
      "Contemporary Romance",
      "Romance",
      "New Adult"
    ],
    "author": "Ali Hazelwood",
    "price": 11.64
  },
  {
    "title": "The Brothers Hawthorne",
    "description": "Four brothers. Two missions. One explosive read. Jennifer Lynn Barnes returns to the world of her #1 bestselling Inheritance Games trilogy, and the stakes have never been higher.Grayson Hawthornewas raised as the heir apparent to his billionaire grandfather, taught from the cradle to put family first. Now the great Tobias Hawthorne is dead and his family disinherited, but some lessons linger. When Grayson’s half-sisters find themselves in trouble, he swoops in to do what he does best: take care of the problem—efficiently, effectively, mercilessly. And without getting bogged down in emotional entanglements.Jameson Hawthorneis a risk-taker, a sensation-seeker, a player of games. When his mysterious father appears and asks for a favor, Jameson can’t resist the challenge. Now he must infiltrate London’s most exclusive underground gambling club, which caters to the rich, the powerful, and the aristocratic, and win an impossible game of greatest stakes. Luckily, Jameson Hawthorne lives for impossible.Drawn into twisted games on opposite sides of the globe, Grayson and Jameson—with the help of their brothers and the girl who inherited their grandfather’s fortune—must dig deep to decide who they want to be and what each of them will sacrifice towin.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1664812464i/62804258.jpg",
    "category": [
      "Mystery",
      "Young Adult",
      "Romance",
      "Fiction",
      "Mystery Thriller",
      "Fantasy",
      "Contemporary"
    ],
    "author": "Jennifer Lynn Barnes",
    "price": 9.88
  },
  {
    "title": "Five Survive",
    "description": "Red Kenny is on a road trip for spring break with five friends: Her best friend - the older brother - his perfect girlfriend - a secret crush - a classmate - and a killer.When their RV breaks down in the middle of nowhere with no cell service, they soon realize this is no accident. They have been trapped by someone out there in the dark, someone who clearly wants one of them dead.With eight hours until dawn, the six friends must escape, or figure out which of them is the target. But is there a liar among them? Buried secrets will be forced to light and tensions inside the RV will reach deadly levels. Not all of them will survive the night...Eight hours. Six friends. Five survive. A road trip turns deadly in this addictive YA thriller from the bestselling author of the worldwide phenomenon A GOOD GIRL'S GUIDE TO MURDER.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1659677880i/60788826.jpg",
    "category": [
      "Mystery",
      "Thriller",
      "Young Adult",
      "Mystery Thriller",
      "Fiction",
      "Audiobook",
      "Contemporary"
    ],
    "author": "Holly  Jackson",
    "price": 17.6
  },
  {
    "title": "Immortality: A Love Story",
    "description": "Hazel Sinnett is alone and half convinced the events of the year before—the immortality, Beecham’s vial—were a figment of her imagination. She doesn’t even know if Jack is alive or dead. All she can really do now is treat patients and maintain Hawthornden Castle as it starts to decay around her.When saving a life leads to her arrest, Hazel seems doomed to rot in prison until a message intervenes: Hazel has been specifically requested to be the personal physician of Princess Charlotte, the sickly granddaughter of King George III. Soon Hazel is dragged into the glamour and romance of a court where everyone has something to hide, especially the enigmatic, brilliant members of a social club known as the Companions to the Death.As Hazel’s work entangles her more and more with the British court, she realizes that her own future as a surgeon isn't the only thing at stake for her. Malicious forces are at work in the monarchy, and Hazel may be the only one capable of setting things right.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1667592421i/60784644.jpg",
    "category": [
      "Historical Fiction",
      "Romance",
      "Fantasy",
      "Young Adult",
      "Fiction",
      "Historical",
      "Audiobook"
    ],
    "author": "Dana Schwartz",
    "price": 14.71
  },
  {
    "title": "Highly Suspicious and Unfairly Cute",
    "description": "From theNew York Timesbestselling author of the Brown Sisters trilogy, comes a laugh-out-loud story about a quirky content creator and a clean-cut athlete testing their abilities to survive the great outdoors--and each other.Bradley Graemeis pretty much perfect. He's a star football player, manages his OCD well (enough), and comes out on top in all his classes . . . except the ones he shares with his ex-best friend, Celine.Celine Bangurais conspiracy-theory-obsessed. Social media followers eat up her takes on everything from UFOs to holiday overconsumption--yet, she's still not cool enough for the popular kids' table. Which is why Bradabandonedher for the in-crowd years ago. (At least, that's how Celine sees it.)These days, there's nothing between them other than petty insults and academic rivalry. So when Celine signs up for a survival course in the woods, she's surprised to find Brad right beside her.Forced to work as a team for the chance to win a grand prize, these two teens must trudge through not just mud and dirt but their messy past. And as this adventure brings them closer together, they begin to remember the good bits of their history. But has too much time passed . . . or just enough to spark a whole new kind of relationship?",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1658632099i/57370115.jpg",
    "category": [
      "Romance",
      "Young Adult",
      "Contemporary",
      "Audiobook",
      "Fiction",
      "Contemporary Romance",
      "Young Adult Romance"
    ],
    "author": "Talia Hibbert",
    "price": 7.8
  },
  {
    "title": "Warrior Girl Unearthed",
    "description": "Perry Firekeeper-Birch was ready for her Summer of Slack but instead, after a fender bender that was entirely not her fault, she’s stuck working to pay back her Auntie Daunis for repairs to the Jeep.Thankfully she has the other outcasts of the summer program, Team Misfit Toys, and even her twin sister Pauline. Together they ace obstacle courses, plan vigils for missing women in the community, and make sure summer doesn’t feel so lost after all.But when she attends a meeting at a local university, Perry learns about the “Warrior Girl”, an ancestor whose bones and knife are stored in the museum archives, and everything changes. Perry has to return Warrior Girl to her tribe. Determined to help, she learns all she can about NAGPRA, the federal law that allows tribes to request the return of ancestral remains and sacred items. The university has been using legal loopholes to hold onto Warrior Girl and twelve other Anishinaabe ancestors’ remains, and Perry and the Misfits won’t let it go on any longer.Using all of their skills and resources, the Misfits realize a heist is the only way to bring back the stolen artifacts and remains for good. But there is more to this repatriation than meets the eye as more women disappear and Pauline’s perfectionism takes a turn for the worse. As secrets and mysteries unfurl, Perry and the Misfits must fight to find a way to make things right – for the ancestors and for their community.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1659757856i/61675933.jpg",
    "category": [
      "Young Adult",
      "Mystery",
      "Fiction",
      "Audiobook",
      "Contemporary",
      "Indigenous",
      "Fantasy"
    ],
    "author": "Angeline Boulley",
    "price": 10.55
  },
  {
    "title": "The Davenports",
    "description": "In 1910, the Davenports are one of the few Black families of immense wealth and status in a changing United States, their fortune made through the entrepreneurship of William Davenport, a formerly enslaved man who founded the Davenport Carriage Company years ago. Now the Davenports live surrounded by servants, crystal chandeliers, and endless parties, finding their way and finding love—even where they're not supposed to.There isOlivia, the beautiful elder Davenport daughter, ready to do her duty by getting married. . . until she meets the charismatic civil rights leader Washington DeWight and sparks fly. The younger daughter,Helen, is more interested in fixing cars than falling in love—unless it's with her sister's suitor.Amy-Rose, the childhood friend turned maid to the Davenport sisters, dreams of opening her own business—and marrying the one man she could never be with, Olivia and Helen's brother, John. But Olivia's best friend,Ruby, also has her sights set on John Davenport, though she can't seem to keep his interest . . . until family pressure has her scheming to win his heart, just as someoneelsewins hers.The first book in a breathless new series,The Davenportsoffers a glimpse into a period of African American history often overlooked, while delivering a totally escapist, swoon-worthy read. Inspired by the real-life story of C.R. Patterson and his family, it's the tale of four determined and passionate young Black women discovering the courage to steer their own path in life—and love.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1654791714i/58469344.jpg",
    "category": [
      "Historical Fiction",
      "Romance",
      "Young Adult",
      "Historical",
      "Fiction",
      "Audiobook",
      "Historical Romance"
    ],
    "author": "Krystal Marquis",
    "price": 7.08
  },
  {
    "title": "Reign",
    "description": "A queen's life hangs in the balance, and her siblings’ decisions—about what to do, and most of all, who to love—could change the course of history. Romance. Duty. Power...only one can triumph in this stunning conclusion to the New York Times bestselling American Royals series.America's royal family is in shambles. Queen Beatrice is in a coma and Princess Samantha has gone missing—from the look of things, she ran away with her boyfriend, Lord Marshall Davis. Which means that Prince Jefferson is currently on the throne. For some in America, it's exactly what they wanted: aKingruling the country. And for Daphne Deighton, who has tricked Jefferson into dating her again, it's the ultimate dream come true.Surely this is all just temporary. Won’t Beatrice wake up and reclaim her rightful place? Samantha can't really be gone…can she? And Prince Jefferson will never truly be over his childhood crush, Nina Gonzalez. Right?For the Washington family, the stakes are higher than ever. Love might save the throne….if secrets don’t destroy everything first.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1676578954i/61948564.jpg",
    "category": [
      "Young Adult",
      "Romance",
      "Audiobook",
      "Fiction",
      "Contemporary",
      "Chick Lit",
      "Fantasy"
    ],
    "author": "Katharine McGee",
    "price": 18.83
  },
  {
    "title": "We Deserve Monuments",
    "description": "Family secrets, a swoon-worthy romance, and a slow-burn mystery collide inWe Deserve Monuments, a YA debut from Jas Hammonds that explores how racial violence can ripple down through generations.What’s more important: Knowing the truth or keeping the peace?Seventeen-year-old Avery Anderson is convinced her senior year is ruined when she's uprooted from her life in DC and forced into the hostile home of her terminally ill grandmother, Mama Letty. The tension between Avery’s mom and Mama Letty makes for a frosty arrival and unearths past drama they refuse to talk about. Every time Avery tries to look deeper, she’s turned away, leaving her desperate to learn the secrets that split her family in two.While tempers flare in her avoidant family, Avery finds friendship in unexpected places: in Simone Cole, her captivating next-door neighbor, and Jade Oliver, daughter of the town’s most prominent family—whose mother’s murder remains unsolved.As the three girls grow closer—Avery and Simone’s friendship blossoming into romance—the sharp-edged opinions of their small southern town begin to hint at something insidious underneath. The racist history of Bardell, Georgia is rooted in Avery’s family in ways she can’t even imagine. With Mama Letty's health dwindling every day, Avery must decide if digging for the truth is worth toppling the delicate relationships she's built in Bardell—or if some things are better left buried.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1644414847i/58484187.jpg",
    "category": [
      "Young Adult",
      "LGBT",
      "Contemporary",
      "Romance",
      "Fiction",
      "Queer",
      "Lesbian"
    ],
    "author": "Jas Hammonds",
    "price": 16.6
  },
  {
    "title": "Never Ever Getting Back Together",
    "description": "When their now famous ex-boyfriend asks them to participate in a teen reality show, two eighteen year old girls—one bent on revenge, the other open to rekindling romance—get tangled up in an unexpected twist when they fall for each other instead inNever Ever Getting Back Togetherby nationally and internationally-bestselling and Indie Next Pick author Sophie Gonzales.It’s been two years since Maya's ex-boyfriend cheated on her, and she still can’t escape him: his sister married the crown prince of a minor European country and he captured hearts as her charming younger brother. If the world only knew the real Jordy, the manipulative liar who broke Maya’s heart.Skye Kaplan was always cautious with her heart until Jordy said all the right things and earned her trust. Now his face is all over the media and Skye is still wondering why he stopped calling.When Maya and Skye are invited to star on the reality dating show Second-Chance Romance, they’re whisked away to a beautiful mansion—along with four more of Jordy’s exes— to compete for his affections while the whole world watches. Skye wonders if she and Jordy can recapture the spark she knows they had, but Maya has other plans: exposing Jordy and getting revenge. As they navigate the competition, Skye and Maya discover that their real happily ever after is nothing they could have scripted.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1643645196i/59808187.jpg",
    "category": [
      "Romance",
      "LGBT",
      "Young Adult",
      "Contemporary",
      "Lesbian",
      "Queer",
      "Fiction"
    ],
    "author": "Sophie Gonzales",
    "price": 8.75
  },
  {
    "title": "Poverty, by America",
    "description": "Reimagining the debate on poverty, making a new and bracing argument about why it persists in America: because the rest of us benefit from it.The United States, the richest country on earth, has more poverty than any other advanced democracy. Why? Why does this land of plenty allow one in every eight of its children to go without basic necessities, permit scores of its citizens to live and die on the streets, and authorize its corporations to pay poverty wages?In this landmark book, acclaimed sociologist Matthew Desmond draws on history, research, and original reporting to show how affluent Americans knowingly and unknowingly keep poor people poor. Those of us who are financially secure exploit the poor, driving down their wages while forcing them to overpay for housing and access to cash and credit. We prioritize the subsidization of our wealth over the alleviation of poverty, designing a welfare state that gives the most to those who need the least. And we stockpile opportunity in exclusive communities, creating zones of concentrated riches alongside those of concentrated despair. Some lives are made small so that others may grow.Elegantly written and fiercely argued, this compassionate book gives us new ways of thinking about a morally urgent problem. It also helps us imagine solutions. Desmond builds a startlingly original and ambitious case for ending poverty. He calls on us all to become poverty abolitionists, engaged in a politics of collective belonging to usher in a new age of shared prosperity and, at last, true freedom.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1665696294i/61358638.jpg",
    "category": [
      "Nonfiction",
      "Politics",
      "Audiobook",
      "Sociology",
      "History",
      "Economics",
      "Social Justice"
    ],
    "author": "Matthew Desmond",
    "price": 18.53
  },
  {
    "title": "Butts: A Backstory",
    "description": "Whether we love them or hate them, think they’re sexy, think they’re strange, consider them too big, too small, or anywhere in between, humans have a complicated relationship with butts. It is a body part unique to humans, critical to our evolution and survival, and yet it has come to signify so much more: sex, desire, comedy, shame. A woman’s butt, in particular, is forever being assessed, criticized, and objectified, from anxious self-examinations trying on jeans in department store dressing rooms to enduring crass remarks while walking down a street or high school hallways. But why? InButts: A Backstory,reporter, essayist, andRadioLabcontributing editor Heather Radke is determined to find out.Spanning nearly two centuries, this “whip-smart” (Publishers Weekly, starred review) cultural history takes us from the performance halls of 19th-century London to the aerobics studios of the 1980s, the music video set of Sir Mix-a-Lot’s “Baby Got Back” and the mountains of Arizona, where every year humans and horses race in a feat of gluteal endurance. Along the way, she meets evolutionary biologists who study how butts first developed; models whose measurements have defined jean sizing for millions of women; and the fitness gurus who created fads like “Buns of Steel.” She also examines the central importance of race through figures like Sarah Bartmann, once known as the “Venus Hottentot,” Josephine Baker, Jennifer Lopez, and other women of color whose butts have been idolized, envied, and despised.Part deep dive reportage, part personal journey, part cabinet of curiosities,Buttsis an entertaining, illuminating, and thoughtful examination of why certain silhouettes come in and out of fashion—and how larger ideas about race, control, liberation, and power affect our most private feelings about ourselves and others.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1667415133i/59366123.jpg",
    "category": [
      "Nonfiction",
      "History",
      "Audiobook",
      "Science",
      "Feminism",
      "Sociology",
      "Adult"
    ],
    "author": "Heather Radke",
    "price": 10.44
  },
  {
    "title": "The Art Thief: A True Story of Love, Crime, and a Dangerous Obsession",
    "description": "One of the most remarkable true-crime narratives of the twenty-first century: the story of the world’s most prolific art thief, Stéphane Breitwieser.In this spellbinding portrait of obsession and flawed genius, the best-selling author ofThe Stranger in the Woodsbrings us into Breitwieser’s strange world—unlike most thieves, he never stole for money, keeping all his treasures in a single room where he could admire them.For centuries, works of art have been stolen in countless ways from all over the world, but no one has been quite as successful at it as the master thief Stéphane Breitwieser. Carrying out more than two hundred heists over nearly eight years—in museums and cathedrals all over Europe—Breitwieser, along with his girlfriend who worked as his lookout, stole more than three hundred objects, until it all fell apart in spectacular fashion.InThe Art Thief, Michael Finkel brings us into Breitwieser’s strange and fascinating world. Unlike most thieves, Breitwieser never stole for money. Instead, he displayed all his treasures in a pair of secret rooms where he could admire them to his heart’s content. Possessed of a remarkable athleticism and an innate ability to circumvent practically any security system, Breitwieser managed to pull off a breathtaking number of audacious thefts. Yet these strange talents bred a growing disregard for risk and an addict’s need to score, leading Breitwieser to ignore his girlfriend’s pleas to stop—until one final act of hubris brought everything crashing down.This is a riveting story of art, crime, love, and an insatiable hunger to possess beauty at any cost.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1701688707i/62873378.jpg",
    "category": [
      "Nonfiction",
      "True Crime",
      "Art",
      "Audiobook",
      "History",
      "Biography",
      "Crime"
    ],
    "author": "Michael Finkel",
    "price": 7.01
  },
  {
    "title": "On Our Best Behavior: The Seven Deadly Sins and the Price Women Pay to Be Good",
    "description": "A groundbreaking exploration of the ancient rules women unwittingly follow in order to be considered \"good,\" revealing how the Seven Deadly Sins still control and distort their lives and illuminating a path toward a more balanced, spiritually complete way to liveWomen congratulate themselves when they resist the doughnut in the office break-room. They celebrate their restraint when they hold back from sending an e-mail in anger. They feel virtuous when they wake up at dawn to get a jump on the day. They put others' needs ahead of their own and believe this makes them exemplary. InOn Our Best Behavior, journalist Elise Loehnen explains that these impulses--often lauded as unselfish, distinctly feminine instincts--are actually ingrained in women by a culture that reaps the benefits, via an extraordinarily effective collection of mores known as the Seven Deadly Sins.Since being codified by the Christian church in the fourth century, the Seven Deadly Sins--pride, greed, lust, envy, gluttony, wrath, and sloth--have exerted insidious power. Even today, in our largely secular, patriarchal society, they continue to circumscribe women's behavior. For example, seeing sloth as sinful leads women to deny themselves rest; a fear of gluttony drives them to ignore their appetites; and an aversion to greed prevents them from negotiating for themselves and contributes to the 55 percent gender wealth gap. Loehnen reveals how women have been programmed to obey the rules represented by these sins and how doing so qualifies them as \"good.\"This probing analysis of contemporary culture and thoroughly researched history explains how women have internalized the patriarchy, and how they unwittingly reinforce it. By sharing her own story and the spiritual wisdom of other traditions, Loehnen shows how women can break free and discover the integrity and wholeness they seek.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1684817671i/63876551.jpg",
    "category": [
      "Nonfiction",
      "Feminism",
      "Audiobook",
      "Psychology",
      "History",
      "Self Help",
      "Womens"
    ],
    "author": "Elise Loehnen",
    "price": 15.68
  },
  {
    "title": "Doppelganger: A Trip into the Mirror World",
    "description": "What if you woke up one morning and found you’d acquired another self―a double who was almost you and yet not you at all? What if that double shared many of your preoccupations but, in a twisted, upside-down way, furthered the very causes you’d devoted your life to fighting against?Not long ago, the celebrated activist and public intellectual Naomi Klein had just such an experience―she was confronted with a doppelganger whose views she found abhorrent but whose name and public persona were sufficiently similar to her own that many people got confused about who was who. Destabilized, she lost her bearings, until she began to understand the experience as one manifestation of a strangeness many of us have come to know but struggle to define: AI-generated text is blurring the line between genuine and spurious communication; New Age wellness entrepreneurs turned anti-vaxxers are scrambling familiar political allegiances of left and right; and liberal democracies are teetering on the edge of absurdist authoritarianism, even as the oceans rise. Under such conditions, reality itself seems to have become unmoored. Is there a cure for our moment of collective vertigo?Naomi Klein is one of our most trenchant and influential social critics, an essential analyst of what branding, austerity, and climate profiteering have done to our societies and souls. Here she turns her gaze inward to our psychic landscapes, and outward to the possibilities for building hope amid intersecting economic, medical, and political crises. With the assistance of Sigmund Freud, Jordan Peele, Alfred Hitchcock, and bell hooks, among other accomplices, Klein uses wry humor and a keen sense of the ridiculous to face the strange doubles that haunt us―and that have come to feel as intimate and proximate as a warped reflection in the mirror.Combining comic memoir with chilling reportage and cobweb-clearing analysis, Klein seeks to smash that mirror and chart a path beyond despair. Doppelganger What do we neglect as we polish and perfect our digital reflections? Is it possible to dispose of our doubles and overcome the pathologies of a culture of multiplication? Can we create a politics of collective care and undertake a true reckoning with historical crimes? The result is a revelatory treatment of the way many of us think and feel now―and an intellectual adventure story for our times.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1689105362i/138505710.jpg",
    "category": [
      "Nonfiction",
      "Politics",
      "Memoir",
      "Audiobook",
      "Psychology",
      "Sociology",
      "Philosophy"
    ],
    "author": "Naomi Klein",
    "price": 16.19
  },
  {
    "title": "Outlive: The Science & Art of Longevity",
    "description": "#1 NEW YORK TIMES BESTSELLER • A groundbreaking manifesto on living better and longer that challenges the conventional medical thinking on aging and reveals a new approach to preventing chronic disease and extending long-term health, from a visionary physician and leading longevity expertWouldn’t you like to live longer? And better? In this operating manual for longevity, Dr. Peter Attia draws on the latest science to deliver innovative nutritional interventions, techniques for optimizing exercise and sleep, and tools for addressing emotional and mental health.For all its successes, mainstream medicine has failed to make much progress against the diseases of aging that kill most people: heart disease, cancer, Alzheimer’s disease, and type 2 diabetes. Too often, it intervenes with treatments too late to help, prolonging lifespan at the expense of healthspan, or quality of life. Dr. Attia believes we must replace this outdated framework with a personalized, proactive strategy for longevity, one where we take action now, rather than waiting.This is not “biohacking,” it’s science: a well-founded strategic and tactical approach to extending lifespan while also improving our physical, cognitive, and emotional health. Dr. Attia’s aim is less to tell you what to do and more to help you learn how to think about long-term health, in order to create the best plan for you as an individual. In Outlive, readers will discover:• Why the cholesterol test at your annual physical doesn’t tell you enough about your actual risk of dying from a heart attack.• That you may already suffer from an extremely common yet underdiagnosed liver condition that could be a precursor to the chronic diseases of aging.• Why exercise is the most potent pro-longevity “drug”—and how to begin training for the “Centenarian Decathlon.”• Why you should forget about diets, and focus instead on nutritional biochemistry, using technology and data to personalize your eating pattern.• Why striving for physical health and longevity, but ignoring emotional health, could be the ultimate curse of all.Aging and longevity are far more malleable than we think; our fate is not set in stone. With the right roadmap, you can plot a different path for your life, one that lets you outlive your genes to make each decade better than the one before.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1700067079i/61153739.jpg",
    "category": [
      "Health",
      "Nonfiction",
      "Science",
      "Self Help",
      "Audiobook",
      "Medicine",
      "Personal Development"
    ],
    "author": "Peter Attia",
    "price": 19.04
  },
  {
    "title": "Trail of the Lost: The Relentless Search to Bring Home the Missing Hikers of the Pacific Crest Trail",
    "description": "From a former law enforcement park ranger and investigator, this female-driven true crime adventure follows the author’s quest to find missing hikers along the Pacific Crest Trail by pairing up with an eclectic group of unlikely allies.As a park ranger with the National Park Service's law enforcement team, Andrea Lankford led search and rescue missions in some of the most beautiful (and dangerous) landscapes across America, from Yosemite to the Grand Canyon. But though she had the support of the agency, Andrea grew frustrated with the service's bureaucratic idiosyncrasies, and left the force after twelve years. Two decades later, however, she stumbles across a mystery that pulls her right back where she left - three young men have vanished from the Pacific Crest Trail, the 2,650-mile trek made famous by Cheryl Strayed's Wild , and no one has been able to find them. It’s bugging the hell out of her.Andrea’s concern soon leads her to a wild environment unlike any she’s ever ventured into - missing person Facebook groups. Andrea launches an investigation, joining forces with an eclectic team of amateurs who are determined to solve the cases: a mother of the missing, a retired pharmacy manager, and a mapmaker who monitors terrorist activity for the government. Together, they track the activities of kidnappers and murderers, investigate a cult, rescue a psychic in peril, cross paths with an unconventional scientist, and reunite an international fugitive with his family. Searching for the missing is a brutal psychological and physical test with the highest stakes, but eventually their hardships begin to bear strange fruits—ones that lead them to places and people they never saw coming.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1701183131i/64000414.jpg",
    "category": [
      "Nonfiction",
      "True Crime",
      "Audiobook",
      "Nature",
      "Adventure",
      "Mystery",
      "Travel"
    ],
    "author": "Andrea Lankford",
    "price": 19.21
  },
  {
    "title": "How Far the Light Reaches: A Life in Ten Sea Creatures",
    "description": "A queer, mixed race writer working in a largely white, male field, science and conservation journalist Sabrina Imbler has always been drawn to the mystery of life in the sea, and particularly to creatures living in hostile or remote environments. Each essay in their debut collection profiles one such creature: the mother octopus who starves herself while watching over her eggs, the Chinese sturgeon whose migration route has been decimated by pollution and dams, the bizarre Bobbitt worm (named after Lorena), and other uncanny creatures lurking in the deep ocean, far below where the light reaches. Imbler discovers that some of the most radical models of family, community, and care can be found in the sea, from gelatinous chains that are both individual organisms and colonies of clones to deep-sea crabs that have no need for the sun, nourished instead by the chemicals and heat throbbing from the core of the Earth. Exploring themes of adaptation, survival, sexuality, and care, and weaving the wonders of marine biology with stories of their own family, relationships, and coming of age,How Far the Light Reachesis a book that invites us to envision wilder, grander, and more abundant possibilities for the way we live.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1665468908i/60769830.jpg",
    "category": [
      "Nonfiction",
      "Science",
      "Memoir",
      "Essays",
      "LGBT",
      "Queer",
      "Nature"
    ],
    "author": "Sabrina Imbler",
    "price": 8.72
  },
  {
    "title": "Opinions: A Decade of Arguments, Criticism, and Minding Other People's Business",
    "description": "From beloved and bestselling author Roxane Gay, “a strikingly fresh cultural critic” (Washington Post) comes an exhilarating collection of her essays on culture, politics, and everything in between. Since the publication of the groundbreakingBad FeministandHunger,Roxane Gay has continued to tackle big issues embroiling society—state-sponsored violence and mass shootings, women’s rights post-Dobbs, online disinformation, and the limits of empathy—alongside more individual topics: Can I tell my co-worker her perfume makes me sneeze? Is it acceptable to schedule a daily 8 am meeting?In her role as a New York Times opinion section contributor and the publication’s “Work Friend” columnist, Gay reaches millions of readers with her wise voice and sharp insights. Opinions is a collection of her best nonfiction pieces from the past ten years. Covering a wide range of topics—politics, feminism, the culture wars, civil rights, and much more—with an all-new introduction in which she reflects on the past decade in America, this sharp, thought-provoking anthology will delight Roxane Gay’s devotees and draw new readers to this inimitable talent.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1692819821i/123195171.jpg",
    "category": [
      "Nonfiction",
      "Essays",
      "Feminism",
      "Audiobook",
      "Politics",
      "Short Stories",
      "LGBT"
    ],
    "author": "Roxane Gay",
    "price": 15.14
  },
  {
    "title": "Cobalt Red: How the Blood of the Congo Powers Our Lives",
    "description": "The revelatoryNew York TimesandPublishers Weeklybestseller, shortlisted for theFinancial TimesBest Business Book of the Year Award.An unflinching investigation reveals the human rights abuses behind the Congo’s cobalt mining operation―and the moral implications that affect us all.Cobalt Redis the searing, first-ever exposé of the immense toll taken on the people and environment of the Democratic Republic of the Congo by cobalt mining, as told through the testimonies of the Congolese people themselves. Activist and researcher Siddharth Kara has traveled deep into cobalt territory to document the testimonies of the people living, working, and dying for cobalt. To uncover the truth about brutal mining practices, Kara investigated militia-controlled mining areas, traced the supply chain of child-mined cobalt from toxic pit to consumer-facing tech giants, and gathered shocking testimonies of people who endure immense suffering and even die mining cobalt.Cobalt is an essential component to every lithium-ion rechargeable battery made today, the batteries that power our smartphones, tablets, laptops, and electric vehicles. Roughly 75 percent of the world’s supply of cobalt is mined in the Congo, often by peasants and children in sub-human conditions. Billions of people in the world cannot conduct their daily lives without participating in a human rights and environmental catastrophe in the Congo. In this stark and crucial book, Kara argues that we must all care about what is happening in the Congo―because we are all implicated.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1666032360i/60784614.jpg",
    "category": [
      "Nonfiction",
      "History",
      "Africa",
      "Politics",
      "Audiobook",
      "Economics",
      "Environment"
    ],
    "author": "Siddharth Kara",
    "price": 12.53
  },
  {
    "title": "The Woman in Me",
    "description": "The Woman in Meis a brave and astonishingly moving story about freedom, fame, motherhood, survival, faith, and hope.In June 2021, the whole world was listening as Britney Spears spoke in open court. The impact of sharing her voice—her truth—was undeniable, and it changed the course of her life and the lives of countless others.The Woman in Mereveals for the first time her incredible journey—and the strength at the core of one of the greatest performers in pop music history.Written with remarkable candor and humor, Spears’s groundbreaking book illuminates the enduring power of music and love—and the importance of a woman telling her own story, on her own terms, at last.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1689090540i/63133205.jpg",
    "category": [
      "Nonfiction",
      "Audiobook",
      "Memoir",
      "Biography",
      "Autobiography",
      "Music",
      "Biography Memoir"
    ],
    "author": "Britney Spears",
    "price": 9.77
  },
  {
    "title": "Spare",
    "description": "It was one of the most searing images of the twentieth century: two young boys, two princes, walking behind their mother’s coffin as the world watched in sorrow—and horror. As Princess Diana was laid to rest, billions wondered what Prince William and Prince Harry must be thinking and feeling—and how their lives would play out from that point on.For Harry, this is that story at last.Before losing his mother, twelve-year-old Prince Harry was known as the carefree one, the happy-go-lucky Spare to the more serious Heir. Grief changed everything. He struggled at school, struggled with anger, with loneliness—and, because he blamed the press for his mother’s death, he struggled to accept life in the spotlight.At twenty-one, he joined the British Army. The discipline gave him structure, and two combat tours made him a hero at home. But he soon felt more lost than ever, suffering from post-traumatic stress and prone to crippling panic attacks. Above all, he couldn’t find true love.Then he met Meghan. The world was swept away by the couple’s cinematic romance and rejoiced in their fairy-tale wedding. But from the beginning, Harry and Meghan were preyed upon by the press, subjected to waves of abuse, racism, and lies. Watching his wife suffer, their safety and mental health at risk, Harry saw no other way to prevent the tragedy of history repeating itself but to flee his mother country. Over the centuries, leaving the Royal Family was an act few had dared. The last to try, in fact, had been his mother. . . .For the first time, Prince Harry tells his own story, chronicling his journey with raw, unflinching honesty. A landmark publication,Spareis full of insight, revelation, self-examination, and hard-won wisdom about the eternal power of love over grief.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1673458354i/62296528.jpg",
    "category": [
      "Nonfiction",
      "Memoir",
      "Audiobook",
      "Biography",
      "Autobiography",
      "Biography Memoir",
      "Adult"
    ],
    "author": "Prince Harry",
    "price": 19.87
  },
  {
    "title": "Pageboy: A Memoir",
    "description": "Pageboyis a groundbreaking coming-of-age memoir from the Academy Award-nominated actor Elliot Page. A generation-defining actor and one of the most famous trans advocates of our time, Elliot will now be known as an uncommon literary talent, as he shares never-before-heard details and intimate interrogations on gender, love, mental health, relationships, and Hollywood.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1670915463i/61317637.jpg",
    "category": [
      "Nonfiction",
      "Memoir",
      "Audiobook",
      "LGBT",
      "Queer",
      "Biography",
      "Biography Memoir"
    ],
    "author": "Elliot Page",
    "price": 19.1
  },
  {
    "title": "Counting the Cost",
    "description": "INSTANT NEW YORK TIMES BESTSELLERFor the first time, discover the unedited truth about the Duggars, the traditional Christian family that captivated the nation on TLC’s hit show 19 Kids and Counting . Jill Duggar and her husband Derick are finally ready to share their story, revealing the secrets, manipulation, and intimidation behind the show that remained hidden from their fans.Jill and Derick knew a normal life wasn’t possible for them. As a star on the popular TLC reality show 19 Kids and Counting , Jill grew up in front of viewers who were fascinated by her family’s way of life. She was the responsible, second daughter of Jim Bob and Michelle’s nineteen kids; always with a baby on her hip and happy to wear the modest ankle-length dresses with throat-high necklines. She didn’t protest the strict model of patriarchy that her family followed, which declares that men are superior, that women are expected to be wives and mothers and are discouraged from attaining a higher education, and that parental authority over their children continues well into adulthood, even once they are married.But as Jill got older, married Derick, and they embarked on their own lives, the red flags became too obvious to ignore.For as long as they could, Jill and Derick tried to be obedient family members—they weren’t willing to rock the boat. But now they’re raising a family of their own, and they’re done with the secrets. Thanks to time, tears, therapy, and blessings from God, they have the strength to share their journey. Theirs is a remarkable story of the power of the truth and is a moving example of how to find healing through honesty.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1686092283i/166175422.jpg",
    "category": [
      "Nonfiction",
      "Memoir",
      "Audiobook",
      "Biography",
      "Religion",
      "Christian",
      "Biography Memoir"
    ],
    "author": "Jill Duggar",
    "price": 7.91
  },
  {
    "title": "All My Knotted-Up Life: A Memoir",
    "description": "New York Times, Publishers Weekly, and Wall Street Journal bestseller!An incredibly thoughtful, disarmingly funny, and intensely vulnerable glimpse into the life and ministry of a woman familiar to many but known by few.“It’s a peculiar thing, this having lived long enough to take a good look back. We go from knowing each other better than we know ourselves to barely sure if we know each other at all, to precisely sure that we don’t. All my knotted-up life I’ve longed for the sanity and simplicity of knowing who’s good and who’s bad. I’ve wanted to know this about myself as much as anyone. This was not theological. It was strictly relational. God could do what he wanted with eternity. I was just trying to make it here in the meantime. As benevolent as he has been in a myriad of ways, God has remained aloof on this uncomplicated request .” – Beth MooreNew York Times best-selling author, speaker, visionary, and founder of Living Proof Ministries Beth Moore has devoted her whole life to helping women across the globe come to know the transforming power of Jesus. An established writer of many acclaimed books and Bible studies for women on spiritual growth and personal development, Beth now unveils her own story in a much-anticipated debut memoir.All My Knotted-Up LifeAll My Knotted-Up Life is told with surprising candor about some of the personal heartbreaks and behind-the-scenes challenges that have marked Beth’s life. But beyond that, it’s a beautifully crafted portrait of resilience and survival, a poignant reminder of God’s enduring faithfulness, and proof positive that if we ever truly took the time to hear people’s full stories . . . we’d all walk around slack-jawed.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1658829975i/61357133.jpg",
    "category": [
      "Memoir",
      "Nonfiction",
      "Audiobook",
      "Christian",
      "Biography",
      "Faith",
      "Biography Memoir"
    ],
    "author": "Beth Moore",
    "price": 14.5
  },
  {
    "title": "Paris: The Memoir",
    "description": "Behind Paris Hilton's meteoric rise from Upper West Side club kid to household name lies her self-proclaimed \"superpower\" of ADHD and a hidden history that traumatized and defined her. Shocking, funny, and surprisingly profound,Parisis the deeply personal memoir of the ultimate It Girl and a stunning inside view of a pop culture phenomenon.Until, in a revealing documentary, Paris Hilton disclosed that her childhood was shattered by two years of strip searches, isolation, beatings, restraint, and brainwashing within the now infamous \"troubled teen industry,\" Paris Hilton was simply the billionaire heiress America had watched grow up on television, on the internet, and in tabloids. But there was always more to Paris Hilton than met the eye. Yes, she is the media personality, DJ, entrepreneur, model, singer, actress, and icon beloved all over the globe. And yet...Parisis the story people have always wanted Paris Hilton to tell--the story of who she really is. In this revealing and thought-provoking book, Hilton will separate the creation from the creator, the brand from the ambassador, and show the woman who grew up with incredible privilege but was also trapped in a world of unreasonable expectation at a moment when young women were humiliated for sport in a gossip economy on steroids.Parisrecounts her perilous journey through pre-#METOO sexual politics with grace, generosity, and plenty of fun, rising above a series of heart-wrenching challenges to find healing, lasting love, and a life of meaning and purpose.The parallel story arcs in Hilton's braided narrative come to full bloom as a watershed portrait of the Aughts, challenging each of us to question our role in her story and her role in ours.The result is an intimate and unexpected memoir about persona and personification, the price of being young and disobedient, and the complexity of manifesting your dreams after watching part of yourself disappear.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1677603541i/61812425.jpg",
    "category": [
      "Nonfiction",
      "Audiobook",
      "Memoir",
      "Biography",
      "Autobiography",
      "Biography Memoir",
      "Mental Health"
    ],
    "author": "Paris Hilton",
    "price": 18.3
  },
  {
    "title": "Hijab Butch Blues",
    "description": "A queer hijabi Muslim immigrant survives her coming-of-age by drawing strength and hope from stories in the Quran in this daring, provocative, and radically hopeful memoir.When fourteen-year-old Lamya H realizes she has a crush on her teacher--herfemaleteacher--she covers up her attraction, an attraction she can't yet name, by playing up her roles as overachiever and class clown. Born in South Asia, she moved to the Middle East at a young age and has spent years feeling out of place, like her own desires and dreams don't matter, and it's easier to hide in plain sight. To disappear. But one day in Quran class, she reads a passage about Maryam that changes everything: when Maryam learned that she was pregnant, she insisted nomanhad touched her. Could Maryam, uninterested in men, be . . . like Lamya?From that moment on, Lamya makes sense of her struggles and triumphs by comparing her experiences with some of the most famous stories in the Quran. She juxtaposes her coming out with Musa liberating his people from the pharoah; asks if Allah, who is neither male nor female, might instead be nonbinary; and, drawing on the faith and hope Nuh needed to construct his ark, begins to build a life of her own--ultimately finding that the answer to her lifelong quest for community and belonging lies in owning her identity as a queer, devout Muslim immigrant.This searingly intimate memoir in essays, spanning Lamya's childhood to her arrival in the United States for college through early-adult life in New York City, tells a universal story of courage, trust, and love, celebrating what it means to be a seeker and an architect of one's own life.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1669666445i/61111274.jpg",
    "category": [
      "Memoir",
      "Nonfiction",
      "Queer",
      "LGBT",
      "Audiobook",
      "Feminism",
      "Religion"
    ],
    "author": "Lamya H.",
    "price": 19.04
  },
  {
    "title": "The In-Between: Unforgettable Encounters During Life's Final Moments",
    "description": "Passionate advocate for end-of-life care and TikTok star Hadley Vlahos shares moving stories of joy, wisdom, and redemption from her patients’ final moments in this “brilliant” (Zibby Owens, Good Morning America ) memoir.Talking about death and dying is considered taboo in polite company, and even in the medical field. Our ideas about dying are confusing at Will our memories flash before our eyes? Regrets consume our thoughts? Does a bright light appear at the end of a tunnel? For most people, it will be a slower process, one eased with preparedness, good humor, and a bit of faith. At the forefront of changing attitudes around palliative care is hospice nurse Hadley Vlahos, who shows that end-of-life care can teach us just as much about how to live as it does about how we die.Vlahos was raised in a strict religious household, but began questioning her beliefs in high school after the sudden death of a friend. When she got pregnant at nineteen, she was shunned by her community and enrolled herself in nursing school to be able to support herself and her baby. But nursing soon became more than that when she focused on palliative care and hospice work, it became a calling.In The In-Between, Vlahos recounts the most impactful experiences she’s had with the people she’s worked with—from the woman who never once questioned her faith until she was close to death, to the older man seeing visions of his late daughter, to the young patient who laments that she spent too much of her short life worrying about what others thought of her—while also sharing her own fascinating journey.Written with profound insight, humility, and respect, The In-Between is a heartrending memoir that shows how caring for others can transform a life while also offering wisdom and comfort for those dealing with loss and providing inspiration for how to live now.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1684817915i/63033521.jpg",
    "category": [
      "Nonfiction",
      "Memoir",
      "Audiobook",
      "Death",
      "Medical",
      "Spirituality",
      "Biography"
    ],
    "author": "Hadley Vlahos",
    "price": 19.65
  },
  {
    "title": "Thicker than Water: A Memoir",
    "description": "Award-winning actor, director, producer, and activist Kerry Washington shares the \"exquisitely moving” journey of her life so far (Isabel Wilkerson), and the bravely intimate story of discovering her truth.While on a drive in Los Angeles, on a seemingly average afternoon, Kerry Washington received a text message that would send her on a life-changing journey of self-discovery. In an instant, her very identity was torn apart, with everything she thought she knew about herself thrown into question.InThicker than Water, Washington gives readers an intimate view into both her public and private worlds—as a mother, daughter, wife, artist, advocate, and trailblazer. Chronicling her upbringing and life’s journey thus far, she reveals how she faced a series of challenges and setbacks, effectively hid childhood traumas, met extraordinary mentors, managed to grow her career, and crossed the threshold into stardom and political advocacy, ultimately discovering her truest self and, with it, a deeper sense of belonging.Throughout this profoundly moving and beautifully written memoir, Washington attempts to answer the questions so many have struggled Who am I? What is my truest and most authentic self? How do I find a deeper sense of connection and belonging? With grace and honesty, she inspires readers to search for—and find—themselves.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1683573107i/88564046.jpg",
    "category": [
      "Memoir",
      "Audiobook",
      "Nonfiction",
      "Biography",
      "Biography Memoir",
      "Autobiography",
      "Adult"
    ],
    "author": "Kerry Washington",
    "price": 14.47
  },
  {
    "title": "The Witching Year: A Memoir of Earnest Fumbling Through Modern Witchcraft",
    "description": "A skeptic’s year-long quest to find spiritual fulfillment through modern Witchcraft, perfect for fans of A.J. Jacobs and Mary Roach.Diana Helmuth, thirty-three, is skeptical of organized religion. She is also skeptical of disorganized religion. But, more than anything, she is tired of God being dead. So, she decides to try on the fastest growing, self-directed faith in Witchcraft.The result is 366 days of observation, trial, error, wit, and back spasms. Witches today are often presented as confident and finished, proud and powerful. Diana is eager to join them. She wants to follow all the rules, memorize all the incantations, and read all the liturgy. But there’s one glaring problem: no Witch can agree on what the right rules, liturgy, and incantations are.As with life, Diana will have to define the craft for herself, looking past the fashionable and figuring out how to define the real. Along the way, she travels to Salem and Edinburgh (two very Crafty hubs) and attends a week-long (clothing optional) Witch camp in Northern California. Whether she’s trying to perform a full moon ritual on a cardboard box, summon an ancient demon with scotch tape and a kitchen trivet, or just trying to become a calmer, happier person, her biggest question Will any of this really work?The Witching Year follows in the footsteps of celebrated memoirs by journalists like A.J. Jacobs, Mary Roach, and Caitlin Doughty, who knit humor and reportage together in search of something worth believing.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1680713930i/125253126.jpg",
    "category": [
      "Nonfiction",
      "Memoir",
      "Spirituality",
      "Witchcraft",
      "Witches",
      "Religion",
      "Biography Memoir"
    ],
    "author": "Diana Helmuth",
    "price": 12.77
  },
  {
    "title": "The Wager: A Tale of Shipwreck, Mutiny and Murder",
    "description": "From the #1New York Timesbestselling author ofKillers of the Flower Moon, a page-turning story of shipwreck, survival, and savagery, culminating in a court martial that reveals a shocking truth. The powerful narrative reveals the deeper meaning of the events on theWager, showing that it was not only the captain and crew who ended up on trial, but the very idea of empire.On January 28, 1742, a ramshackle vessel of patched-together wood and cloth washed up on the coast of Brazil. Inside were thirty emaciated men, barely alive, and they had an extraordinary tale to tell. They were survivors of His Majesty's Ship theWager, a British vessel that had left England in 1740 on a secret mission during an imperial war with Spain. While theWagerhad been chasing a Spanish treasure-filled galleon known as \"the prize of all the oceans,\" it had wrecked on a desolate island off the coast of Patagonia. The men, after being marooned for months and facing starvation, built the flimsy craft and sailed for more than a hundred days, traversing nearly 3,000 miles of storm-wracked seas. They were greeted as heroes.But then . . . six months later, another, even more decrepit craft landed on the coast of Chile. This boat contained just three castaways, and they told a very different story. The thirty sailors who landed in Brazil were not heroes - they were mutineers. The first group responded with countercharges of their own, of a tyrannical and murderous senior officer and his henchmen. It became clear that while stranded on the island the crew had fallen into anarchy, with warring factions fighting for dominion over the barren wilderness. As accusations of treachery and murder flew, the Admiralty convened a court martial to determine who was telling the truth. The stakes were life-and-death--for whomever the court found guilty could hang.The Wageris a grand tale of human behavior at the extremes told by one of our greatest nonfiction writers. Grann's recreation of the hidden world on a British warship rivals the work of Patrick O'Brian, his portrayal of the castaways' desperate straits stands up to the classics of survival writing such asThe Endurance, and his account of the court martial has the savvy of a Scott Turow thriller. As always with Grann's work, the incredible twists of the narrative hold the reader spellbound.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1659407155i/61714633.jpg",
    "category": [
      "Nonfiction",
      "History",
      "Audiobook",
      "Adventure",
      "Historical",
      "True Crime",
      "Mystery"
    ],
    "author": "David Grann",
    "price": 12.76
  },
  {
    "title": "The Six: The Untold Story of America's First Women Astronauts",
    "description": "In the bestselling tradition of Hidden Figures and Code Girls, the remarkable true story of America’s first women astronauts—six extraordinary women, each making history going to orbit aboard NASA’s Space Shuttle.When NASA sent astronauts to the moon in the 1960s and 1970s the agency excluded women from the corps, arguing that only military test pilots—a group then made up exclusively of men—had the right stuff. It was an era in which women were steered away from jobs in science and deemed unqualified for space flight. Eventually, though, NASA recognized its blunder and opened the application process to a wider array of hopefuls, regardless of race or gender. From a candidate pool of 8,000 six elite women were selected in 1978—Sally Ride, Judy Resnik, Anna Fisher, Kathy Sullivan, Shannon Lucid, and Rhea Seddon.In The Six , acclaimed journalist Loren Grush shows these brilliant and courageous women enduring claustrophobic—and sometimes deeply sexist—media attention, undergoing rigorous survival training, and preparing for years to take multi-million-dollar payloads into orbit. Together, the Six helped build the tools that made the space program run. One of the group, Judy Resnik, sacrificed her life when the Space Shuttle Challenger exploded at 46,000 feet. Everyone knows of Sally Ride’s history-making first space ride, but each of the Six would make their mark.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1686761136i/101160753.jpg",
    "category": [
      "Nonfiction",
      "History",
      "Science",
      "Biography",
      "Space",
      "Audiobook",
      "Feminism"
    ],
    "author": "Loren Grush",
    "price": 14.7
  },
  {
    "title": "Killing the Witches: The Horror of Salem, Massachusetts",
    "description": "With over 19 million copies in print and a remarkable record of #1New York Times, Wall Street Journal, USA Today, andPublishers Weeklybestsellers, Bill O'Reilly'sKillingseries is the most popular series of narrative histories in the world.Killing the Witchesrevisits one of the most frightening and inexplicable episodes in American history: the events of 1692 and 1693 in Salem Village, Massachusetts. What began as a mysterious affliction of two young girls who suffered violent fits and exhibited strange behavior soon spread to other young women. Rumors of demonic possession and witchcraft consumed Salem. Soon three women were arrested under suspicion of being witches--but as the hysteria spread, more than 200 people were accused. Thirty were found guilty, twenty were executed, and others died in jail or their lives were ruined.What really happened in Salem? Killing the Witchestells the horrifying story of a colonial town's madness, offering the historical context of similar episodes of community mania during that time, and exploring the evidence that emerged in the Salem trials, in contemporary accounts, and in subsequent investigations. The result is a compulsively readable book about good, evil, and how fear can overwhelm fact and reason.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1675642559i/65214203.jpg",
    "category": [
      "History",
      "Nonfiction",
      "Audiobook",
      "Historical",
      "Witches",
      "American History",
      "Religion"
    ],
    "author": "Bill O'Reilly",
    "price": 8.42
  },
  {
    "title": "Valiant Women: The Extraordinary American Servicewomen Who Helped Win World War II",
    "description": "A history of the role of American servicewomen in WWII, illuminating their forgotten yet essential contributions to the Allies' victory.Valiant Womenis the story of the 350,000 American women who served in uniform during World War II. These women served in every service branch, in every combat theater, and in nearly two-thirds of the available military occupations at the time. They were pilots, codebreakers, ordnance experts, gunnery instructors, metalsmiths, chemists, translators, parachute riggers, truck drivers, radarmen, pigeon trainers, and much more. They were directly involved in some of the most important moments of the war, from the D-Day landings to the peace negotiations in Paris. These women--who hailed from every race, creed, and walk of life--died for their country and received the nation's highest honors. Their work, both individually and in total, was at the heart of the Allied strategy that won World War II. Yet, until now, their stories have been relegated to the dusty shelves of military archives or a passing mention in the local paper. Often the women themselves kept their stories private, even from their own families. Now, military analyst Lena Andrews corrects the record with the definitive and comprehensive historical account of American servicewomen during World War II, based on new archival research, firsthand interviews with surviving veterans, and a deep professional understanding of military history and strategy.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1675526626i/61858962.jpg",
    "category": [
      "Nonfiction",
      "History",
      "World War II",
      "War",
      "Feminism",
      "Historical",
      "Audiobook"
    ],
    "author": "Lena Andrews",
    "price": 12.57
  },
  {
    "title": "Black AF History: The Un-Whitewashed Story of America",
    "description": "From acclaimed columnist and political commentator Michael Harriot, a searingly smart and bitingly hilarious retelling of American history that corrects the record and showcases the perspectives and experiences of Black Americans.America’s backstory is a whitewashed mythology implanted in our collective memory. It is the story of the pilgrims on the Mayflower building a new nation. It is George Washington’s cherry tree and Abraham Lincoln’s log cabin. It is the fantastic tale of slaves that spontaneously teleported themselves here with nothing but strong backs and negro spirituals. It is a sugarcoated legend based on analmosttrue story.It should come as no surprise that the dominant narrative of American history is blighted with errors and oversights—after all, history books were written by white men with their perspectives at the forefront. It could even be said that the devaluation and erasure of the Black experience is as American as apple pie.InBlack AF History, Michael Harriot presents a more accurate version of American history. Combining unapologetically provocative storytelling with meticulous research based on primary sources as well as the work of pioneering Black historians, scholars, and journalists, Harriot removes the white sugarcoating from the American story, placing Black people squarely at the center. With incisive wit, Harriot speaks hilarious truth to oppressive power, subverting conventional historical narratives with little-known stories about the experiences of Black Americans. From the African Americans who arrived before 1619 to the unenslavable bandit who inspired America’s first police force, this long overdue corrective provides a revealing look into our past that is as urgent as it is necessary. For too long, we have refused to acknowledge that American history iswhite history. Not this one. This history isBlack AF.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1623377719i/55959466.jpg",
    "category": [
      "History",
      "Nonfiction",
      "Race",
      "Audiobook",
      "Politics",
      "Social Justice",
      "Historical"
    ],
    "author": "Michael Harriot",
    "price": 12.44
  },
  {
    "title": "A Fever in the Heartland: The Ku Klux Klan's Plot to Take Over America, and the Woman Who Stopped Them",
    "description": "A historical thriller by the Pulitzer and National Book Award-winning author that tells the riveting story of the Klan's rise to power in the 1920s, the cunning con man who drove that rise, and the woman who stopped them.The Roaring Twenties--the Jazz Age--has been characterized as a time of Gatsby frivolity. But it was also the height of the uniquely American hate group, the Ku Klux Klan. Their domain was not the old Confederacy, but the Heartland and the West. They hated Blacks, Jews, Catholics and immigrants in equal measure, and took radical steps to keep these people from the American promise. And the man who set in motion their takeover of great swaths of America was a charismatic charlatan named D.C. Stephenson.Stephenson was a magnetic presence whose life story changed with every telling. Within two years of his arrival in Indiana, he’d become the Grand Dragon of the state and the architect of the strategy that brought the group out of the shadows – their message endorsed from the pulpits of local churches, spread at family picnics and town celebrations. Judges, prosecutors, ministers, governors and senators across the country all proudly proclaimed their membership. But at the peak of his influence, it was a seemingly powerless woman – Madge Oberholtzer – who would reveal his secret cruelties, and whose deathbed testimony finally brought the Klan to their knees.A FEVER IN THE HEARTLAND marries a propulsive drama to a powerful and page-turning reckoning with one of the darkest threads in American history.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1659417830i/61423989.jpg",
    "category": [
      "Nonfiction",
      "History",
      "True Crime",
      "Audiobook",
      "American History",
      "Politics",
      "Race"
    ],
    "author": "Timothy Egan",
    "price": 10.4
  },
  {
      "title": "Do Epic Shit",
      "description": "A collection of insights on life, work, and relationships, offering practical advice for building a fulfilling life and career.",
      "publicationDate": "2021-12-17",
      "image": "https://m.media-amazon.com/images/I/41oYp387k8L._SY445_SX342_.jpg",
      "publisher": "Juggernaut Books",
      "ISBN": "9789391165482",
      "author": "Ankur Warikoo",
      "categories": ["Self-Help", "Personal Development", "Motivation"],
      "price": 10.99
    },
    {
      "title": "Get Epic Shit Done",
      "description": "A mentor-mentee conversation focusing on productivity, goal-setting, and overcoming challenges with actionable steps.",
      "publicationDate": "2022-12-15",
      "image": "https://m.media-amazon.com/images/I/51I5OZ7Kb9L._SL1500_.jpg",
      "publisher": "Juggernaut Books",
      "ISBN": "9789393986047",
       "author": "Ankur Warikoo",
      "categories": ["Productivity", "Self-Help", "Time Management"],
      "price":12.99
    },
    {
      "title": "Make Epic Money",
      "description": "A guide to transforming your mindset about money, focusing on multiple income streams, investments, and financial freedom.",
      "publicationDate": "2024-01-15",
      "image": "https://m.media-amazon.com/images/I/718a74M1FNL._SL1500_.jpg",
      "publisher": "Ebury Edge",
      "ISBN": "9781529146868",
       "author": "Ankur Warikoo",
      "categories": ["Personal Finance", "Wealth Creation", "Financial Literacy"],
      "price": 14.99
    },
  {
    "title": "Pathogenesis: A History of the World in Eight Plagues",
    "description": "An account of how the major transformations in history—from the rise of Homo sapiens to the birth of capitalism—have been shaped not by humans but by germsAccording to the accepted narrative of progress, humans have thrived thanks to their brains and brawn, collectively bending the arc of history. But in this revelatory book, Professor Jonathan Kennedy argues that the myth of human exceptionalism overstates the role that we play in social and political change. Instead, it is the humble microbe that wins wars and topples empires.Drawing on the latest research in fields ranging from genetics and anthropology to archaeology and economics,Pathogenesistakes us through sixty thousand years of history, exploring eight major outbreaks of infectious disease that have made the modern world. Bacteria and viruses were protagonists in the demise of the Neanderthals, the growth of Islam, the transition from feudalism to capitalism, the devastation wrought by European colonialism, and the evolution of the United States from an imperial backwater to a global superpower. Even Christianity rose to prominence in the wake of a series of deadly pandemics that swept through the Roman Empire in the second and third centuries: Caring for the sick turned what was a tiny sect into one of the world’s major religions.By placing disease at the center of his wide-ranging history of humankind, Kennedy challenges some of the most fundamental assumptions about our collective past—and urges us to view this moment as another disease-driven inflection point that will change the course of history. Provocative and brimming with insight,Pathogenesistransforms our understanding of the human story.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1656310837i/61327450.jpg",
    "category": [
      "Nonfiction",
      "History",
      "Science",
      "Audiobook",
      "Medicine",
      "Health",
      "Biology"
    ],
    "author": "Jonathan Kennedy",
    "price": 15.1
  },
  {
    "title": "The Earth Transformed: An Untold History",
    "description": "A revolutionary new history that reveals how climate change has dramatically shaped the development—and demise—of civilizations across timeGlobal warming is one of the greatest dangers mankind faces today. Even as temperatures increase, sea levels rise, and natural disasters escalate, our current environmental crisis feels difficult to predict and understand. But climate change and its effects on us are not new. In a bold narrative that spans centuries and continents, Peter Frankopan argues that nature has always played a fundamental role in the writing of history. From the fall of the Moche civilization in South America that came about because of the cyclical pressures of El Niño to volcanic eruptions in Iceland that affected Egypt and helped bring the Ottoman empire to its knees, climate change and its influences have always been with us.Frankopan explains how the Vikings emerged thanks to catastrophic crop failure, why the roots of regime change in Eleventh-Century Baghdad lay in the collapse of cotton prices resulting from unusual climate patterns, and why the western expansion of the frontiers in North America was directly affected by solar flare activity in the eighteenth century. Again and again, Frankopan shows that when past empires have failed to act sustainably, they have been met with catastrophe. Blending brilliant historical writing and cutting-edge scientific research,Climatewill radically reframe the way we look at the world and our future.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1677838656i/61965394.jpg",
    "category": [
      "History",
      "Nonfiction",
      "Science",
      "Environment",
      "Nature",
      "World History",
      "Climate Change"
    ],
    "author": "Peter Frankopan",
    "price": 19.65
  },
  {
    "title": "Star Crossed: A True Romeo and Juliet Story in Hitler's Paris",
    "description": "Paris, 1940. The City of Light has fallen under German Occupation. Among patriotic Parisians, the pursuit of art, culture, and jazz have become bold acts of defiance. So has forbidden romance for talented and spirited Jewish teenager Annette Zelman, a student at the Beaux-Arts, and dashing young Catholic poet Jean Jausion. Despite their devout families' vehement opposition, the young couple finds acceptance at the famed Café de Flore, whose habitues include Simone de Beauvoir, Jean-Paul Sartre, Pablo Picasso, Django Reinhardt, and other luminaries of the Latin Quarter's creative world.For a time, Annette and Jean feel they have eluded the brute might of the relentless Nazis--and more immediately, their parents' threats and demands. But as restrictions on the Jewish community escalate to arrests and deportations, the malevolent forces gathering around the young lovers set them on divergent and tragically inevitable paths. Drawn from never-before-published family letters and other treasures, as well as archival sources and exclusive interviews,Star-Crossedoffers precious insight into the Holocaust and the lives that French people bravely led under the Hitler regime.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1657977372i/60098287.jpg",
    "category": [
      "History",
      "Nonfiction",
      "World War II",
      "Biography",
      "Romance",
      "Historical",
      "War"
    ],
    "author": "Heather Dune Macadam",
    "price": 11.91
  },
  {
    "title": "Being Henry: The Fonz . . . and Beyond",
    "description": "From Emmy-award winning actor, author, comedian, producer, and director Henry Winkler, a deeply thoughtful memoir of the lifelong effects of stardom and the struggle to become wholeHenry Winkler, launched into prominence by his role as “the Fonz” in the belovedHappy Days, has transcended the role that made him who he is. Brilliant, funny, and widely regarded as the nicest man in Hollywood (though he would be the first to tell you that it’s simply not the case, he’s really just grateful to be here), Henry shares in this achingly vulnerable memoir the disheartening truth of his childhood, the difficulties of a life with severe dyslexia, the pressures of a role that takes on a life of its own, and the path forward once your wildest dream seems behind you.Since the glorious era ofHappy Daysfame, Henry has endeared himself to new generations with roles in such adored shows asArrested Development,Parks and Recreation, andBarry, where he’s been revealed as an actor with immense depth and pathos, a departure from the period of his life when he was so distinctly typecast as the Fonz that he could hardly find work.Filled with profound heart, charm, and self-deprecating humor,Being Henryis a memoir about so much more than a life in Hollywood and the curse of stardom. It is a meaningful testament to the power of sharing truth and kindness and of finding fulfillment within yourself.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1677855868i/65215014.jpg",
    "category": [
      "Nonfiction",
      "Memoir",
      "Audiobook",
      "Biography",
      "Autobiography",
      "Humor",
      "Biography Memoir"
    ],
    "author": "Henry Winkler",
    "price": 17.2
  },
  {
    "title": "Leslie F*cking Jones",
    "description": "Hey you guys, it’s Leslie. I’m excited to share my story with you.Now, I’m gonna be honest: Some of the details might be vague because a b*tch is fifty-five and she’s smoked a ton of weed. But while bits might be a touch hazy, I can promise you the underlying truth is REAL. Whether I’m talking about my childhood growing up in the South, my early stand-up days driving from gig to gig through the darkest parts of our country and praying I wouldn’t get murdered, what Chris Rock told Lorne Michaels, that time I wanted to shoot Whoopi Goldberg on SNL, and yeah, I’ll tell you all about Ghostbusters and the nudes and Supermarket Sweep and The Daily Show . . . I’m sharing it all in these pages. It’s not easy being a woman in comedy, especially when you’re a tall-*ss Black woman with a trumpet voice. I have to fight so that no one takes me for granted, and no one takes advantage. These are the stories that explain why. (Cue the Law & Order theme.)",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1680721617i/123027172.jpg",
    "category": [
      "Memoir",
      "Nonfiction",
      "Audiobook",
      "Humor",
      "Biography",
      "Comedy",
      "Biography Memoir"
    ],
    "author": "Leslie     Jones",
    "price": 12.78
  },
  {
    "title": "Sure, I'll Join Your Cult: A Memoir of Mental Illness and the Quest to Belong Anywhere",
    "description": "A brutally honest and hilariously frenetic memoir about show business, mental health, and the comfort of rigid belief systems—from Dale Carnegie’sHow to Win Friends and Influence People, to Suzuki violin training, to Richard Simmons, to 12-step programs.Maria Bamford is a comedian’s comedian (an outsider among outsiders) and has forever fought to find a place to belong. From struggling with an eating disorder as a child of the 1980s, to navigating a career in the arts (and medical debt and psychiatric institutionalization), she has tried just about every method possible to not only be a part of the world, but to want to be a part of it.In Bamford’s signature voice,Sure, I’ll Join Your Cult, brings us on a quest to participate insomething. With sincerity and transparency, she recounts every anonymous fellowship she has joined (including but not limited to: Debtors Anonymous, Sex and Love Addicts Anonymous, and Overeaters Anonymous), every hypomanic episode (from worrying about selling out under capitalism to enforcing union rules on her Netflix TV show set to protect her health), and every easy 1-to-3-step recipe for fudge in between.Singular and inimitable, Bamford’s memoir explores what it means to keep going, and to be a member of society (or any group she’s invited to) despite not being very good at it. In turn, she hopes to transform isolating experiences into comedy that will make you feel less alone (without turning into a cult following).",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1683135532i/112093865.jpg",
    "category": [
      "Memoir",
      "Nonfiction",
      "Audiobook",
      "Humor",
      "Mental Health",
      "Biography",
      "Comedy"
    ],
    "author": "Maria Bamford",
    "price": 14.83
  },
  {
    "title": "Quietly Hostile: Essays",
    "description": "Samantha Irby invites us to share in the gory particulars of her real life, all that festers behind the glitter and glam.The success of Irby's career has taken her to new heights. She fields calls with job offers from Hollywood and walks the red carpet with the iconic ladies of Sex and the City. Finally, she has made it. But, behind all that new-found glam, Irby is just trying to keep her life together as she always had.Her teeth are poisoning her from inside her mouth, and her diarrhea is back. She gets turned away from a restaurant for wearing ugly clothes, she goes to therapy and tries out Lexapro, gets healed with Reiki, explores the power of crystals, and becomes addicted to QVC. Making light of herself as she takes us on an outrageously funny tour of all the details that make up a true portrait of her life, Irby is once again the relatable, uproarious tonic we all need.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1663419469i/62052300.jpg",
    "category": [
      "Nonfiction",
      "Essays",
      "Humor",
      "Memoir",
      "Audiobook",
      "LGBT",
      "Queer"
    ],
    "author": "Samantha Irby",
    "price": 14.14
  },
  {
    "title": "Strong Female Character",
    "description": "'This is a book about how being a woman gets in the way of people's expectation of what autism should look like and, equally, how being autistic gets in the way of people's expectations of what a woman should look like.'Strong Female Character is a game-changing memoir on sexism and neurodiversity. Fern Brady will use her voice as a neurodivergent, working-class woman from Scotland to bring issues such as sex work, abusive relationships and her time spent in teenage mental health units to the page. It will take a sledgehammer to the Manic Pixie Dream Girl trope which is mistakenly applied to neurodiverse women. It will also look at how her lack of regard for social expectations ultimately meant she surpassed any limitations of what a Scottish working-class woman can do.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1670358571i/59903149.jpg",
    "category": [
      "Nonfiction",
      "Memoir",
      "Audiobook",
      "Autistic Spectrum Disorder",
      "Biography",
      "Feminism",
      "Mental Health"
    ],
    "author": "Fern  Brady",
    "price": 15.48
  },
  {
    "title": "Unruly: A History of England's Kings and Queens",
    "description": "Discover who we are and how we got here in comedian, star of Peep Show and student of history David Mitchell's A History of England's Kings and Queens - a thoughtful, funny exploration of the founding fathers and mothers of England, and subsequently Britain.Think you know your kings and queens? Think again.In UNRULY , David Mitchell explores how England's monarchs, while acting as feared rulers firmly guiding their subjects' destinies, were in reality a bunch of lucky sods who were mostly as silly and weird in real life as they appear today in their portraits.Taking us right back to King Arthur ( he didn't exist), David tells the founding story of post-Roman England right up to the reign of Elizabeth I ( she dies). It's a tale of narcissists, inadequate self-control, excessive beheadings, middle-management insurrection, uncivil wars, and at least one total Cnut, as the population evolved from having their crops nicked by the thug with the largest armed gang to bowing and paying taxes to a divinely anointed king.How this happened, who it happened to and why it matters in modern Britain are all questions David answers with brilliance, wit and the full erudition of a man who once studied history - and won't let it off the hook for the mess it's made.A funny book about a serious subject, UNRULY is for anyone who has ever wondered how we got here - and who is to blame.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1683348009i/150038752.jpg",
    "category": [
      "History",
      "Nonfiction",
      "Audiobook",
      "Humor",
      "Historical",
      "Comedy",
      "British Literature"
    ],
    "author": "David   Mitchell",
    "price": 19.13
  },
  {
    "title": "The World Record Book of Racist Stories",
    "description": "From theNew York Timesbestselling authors ofYou’ll Never Believe What Happened to Lacey, comedian Amber Ruffin and her sister Lacey, a new collection of hilarious, intergenerational anecdotes full of absurd detail about everyday experiences of racism.Families may not always see eye to eye; we get on each other’s nerves, have different perspectives and lives—especially when we consider how we've grown up in different generations. But for the Ruffin family and many others, there has been one constant that connects them: racism hasn’t gone anywhere.From her raucous musical numbers to turning upsetting news into laughs as the host ofThe Amber Ruffin Showor in herLate Night with Seth Meyerssegments, Amber is no stranger to finding the funny wherever she looks. With equal parts heart and humor, she and her sister Lacey Lamar shared some of the eye-opening and outrageous experiences Lacey had faced in Nebraska in their first book. Now, the dynamic duo makes it clear—Lacey isn’t the only one in the family with ridiculous encounters to share! Amber and Lacey have many more uproarious stories, both from their own lives and the entire Ruffin family.Recounting the wildest tales of racism from their parents, their siblings, and Amber’s nieces and nephews, this intergenerational look at ludicrous (but all too believable) everyday racism as experienced across age, gender, and appearance will have you gasping with shockandlaughter in turn. Validating for anyone who has first-hand experience, and revealing for anyone who doesn’t, Amber and Lacey’s next book helps us all find the absurdity in the pervasive frustrations of racism. Illuminating and packed with love and laughter, this is a must-read for just about everyone.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1647264717i/60568490.jpg",
    "category": [
      "Nonfiction",
      "Humor",
      "Audiobook",
      "Memoir",
      "Race",
      "Essays",
      "Social Justice"
    ],
    "author": "Amber Ruffin",
    "price": 15.44
  },
  {
    "title": "Black Friend: Essays",
    "description": "From a rapidly rising comedy star, a bold, biting, and deeply hilarious takedown—and send-up—of our culture’s (mis)understanding of raceZiwe made a name for herself staring interviewees in the eye and asking: “How many Black friends do you have?” She’s an expert at making people squirm, coming right out and asking the tough questions about race and racism that our culture has made white people experts at dancing around.InThe Book of Ziwe, she turns this incisive perspective on the culture at large, with the signature blend of devastating bluntness and incredible warmth that keeps her guests coming back. Throughout the book, Ziwe mixes bite-sized moments of insight with longer essays that take a range of forms, from serious distillations of cultural phenomena to a transcript of “A Conversation with a Cancelled White Person,” and even a Choose Your Own Adventure-style piece about navigating race in everyday life.Personal and funny, but also challenging and engaging,The Book of Ziwetackles questions about race and racism head-on, approaching the issue in a manner that evokes the way it comes up in the real world—not through deliberate studies of history and theory, which are so important, but in an awkward conversation at a party or ayikescomment from a coworker in the break room. The book lives in the moment of discomfort that can be the most truly educational way of unlearning biases. Plus, like everything Ziwe does, it will startle you with how much it makes you laugh.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1682786321i/56969544.jpg",
    "category": [
      "Nonfiction",
      "Essays",
      "Memoir",
      "Humor",
      "Race",
      "Comedy",
      "Audiobook"
    ],
    "author": "Ziwe",
    "price": 18.65
  },
  {
    "title": "Congratulations, the Best is Over!",
    "description": "The beloved bestselling author ofHere for Itpresents a collection of heartening, thoughtful, and laugh-out-loud essays about the lifelong search for community and returning home.After going viral \"reading\" the chaotic political news, having one-too-many awkward social encounters, and coming to terms with his intersecting identities, R. Eric Thomas is ready to live his best life--or, if not, at least his best-ish life.Now, in this collection of insightful and hilarious essays, Thomas finds himself doing things completely out of character, starting with moving back to his perpetually misunderstood hometown of Baltimore. They say you can't go home again, but what if you and home have changed beyond recognition? From attending his twenty-year high school reunion and discovering another person's face on his name badge, to splattering an urgent care room with blood à laThe Shining, to being terrorized by a plague of gay frogs who've overtaken his backyard, Thomas shares the nitty, and sometimes gritty, details of wrestling with your past life while in the middle of a new one. With wit, heart, and hope for the future,Congratulations, The Best Is Over!is the not-so-gentle reminder we all need that even when life doesn't go according to plan, we can still find our way back home.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1684817432i/71872896.jpg",
    "category": [
      "Nonfiction",
      "Essays",
      "Memoir",
      "Humor",
      "Audiobook",
      "LGBT",
      "Short Stories"
    ],
    "author": "R. Eric Thomas",
    "price": 12.9
  },
  {
    "title": "It Was an Ugly Couch Anyway: And Other Thoughts on Moving Forward",
    "description": "A collection of refreshingly honest and hilarious essays from Southern Living columnist Elizabeth Passarella about navigating change--whether emotional or logistical--and staying sane during life's unexpected twists and turns. After Elizabeth Passarella and her husband finally decided that it was time to sell their two-bedroom apartment in Manhattan, she found herself wondering, Is there a proper technique for skinning a couch? The couch in question was a beloved hand-me-down from her father--who had recently passed away--and she was surprisingly reluctant to let the nine-foot, plaid, velour-covered piece of furniture go. So, out came the scissors. She kept the fabric and tossed the couch. We've all had to make decisions in our lives about what to keep and what to toss--habits, attitudes, friends, even homes. In this new collection of essays, Elizabeth explores the ups and downs of moving forward--both emotionally and logistically--with her welcome candor and sense of humor that readers have come to love. She enters into a remarkable (and strange) relationship with an elderly neighbor whose apartment she hopes to buy, examines her own stubborn stances on motherhood and therapy, and tries to come to terms with a family health crisis that brings more questions than answers. Along the way Elizabeth reminds readers that when they feel stuck or their load feels heavy, there is always light breaking in somewhere. It Was an Ugly Couch Anyway will make readers laugh, cry, and feel a little less alone as they navigate their own lives that are filled with uncertainty, change, and things beyond their control.",
    "image": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1662442622i/61349388.jpg",
    "category": [
      "Nonfiction",
      "Memoir",
      "Audiobook",
      "Essays",
      "Humor",
      "Biography",
      "Self Help"
    ],
    "author": "Elizabeth Passarella",
    "price": 11.4
  }
]
